=begin
$N : 自己的名字.
$n : 目标的名字.
$P : 自己的人称代名词.
$p : 目标的人称代名词.
$S : 对自己的称呼。
$s : 对自己的粗鲁称呼。
$C : 别人对自己的尊称。
$c : 别人对自己的粗鲁称呼。
$R : 对别人的尊称。
$r : 对别人的粗鲁称呼。\n");
=end
def emote_list
{
    
  'mad2' => {
              'others' => '$N脸上一红，目光中闪耀着喜悦的光芒，说道：「你没来瞧我，我好生恼你。」',
              'others_target' => '$N道：「这个$n倘若落在我手里，哼哼，我先绑住了$p，狠狠拷打$p一顿，打得$p屁股变成四片。然后我提起刀子，一刀砍将下去，这么擦的一声……」'
            },
  'nogood' => {
                'others' => '$N轻轻叹了口气，说道：「你干什么撇下我？难道你死了我还能活么？难道你到今天还不知道我的心么？」 说着眼泪掉了下来，一滴滴的落在酒杯之中。',
                'others_target' => '$N忽然俏脸一板，眉间隐现怒色，说道：「$n$c，你不好！」 '
              },
  'cruel' => {
               'others' => '$N大声道：「你这般残忍凶狠，你不惭愧么？」 ',
               'others_target' => '$N惊怒交集，立即拔出长剑，指着$n道：「你这$r，当真活得不耐烦了？」 '
             },
  'puke' => {
              'others' => '$N突然「稀哩哗啦」呕出了一大堆东西。',
              'others_target' => '$N「稀哩哗啦」吐了$n一身。'
            },
  'handsome2' => {
                   'others' => '$N说道：「我是中原武林的第一风流浪子，外号人称‘粉面郎君武潘安’，你想不想见？」',
                   'others_target' => '$N指着$n不住娇笑，说道：「你……你……你这丑八怪，居然自称什么‘中原第一风流浪子’……」'
                 },
  'baby' => {
              'others' => '$N不断哄道：「乖宝宝，我的乖宝宝，乖宝宝快睡觉。」语气中充满了慈爱。',
              'others_target' => '$N柔声哄$n道：「心肝宝贝，乖孩儿，你白白胖胖的，多么有趣，我要玩你到晚上，这才弄死你。」'
            },
  'bully' => {
               'others' => '$N大声哭叫：「打死人啦，大人欺负小孩哪！」',
               'others_target' => '$N突然小嘴一扁，放声大哭，边哭边叫：「$n，你欺侮我！你欺侮我！」'
             },
  'fat' => {
             'others' => '$N照了一眼镜子，吃惊的叫到: 耶！好大的一面哈哈镜喔！',
             'others_target' => '$N指着$n的鼻子，天真的叫道: 妈妈！看！好大的河马耶！'
           },
  'sigh3' => {
               'others' => '$N轻轻叹息一声，觉尘世之间，事事都是索然无味。',
               'others_target' => '$N问$n道：「$c，你叹什么气？说我太也顽皮么？」'
             },
  'seduce' => {
                'others' => '$N满脸的媚态，作出一副迷人的姿态诱惑所有在场的人。',
                'others_target' => '$N满脸的媚态，作出一副迷人的姿态诱惑$n。'
              },
  'lean2' => {
               'others' => '$N笑道：「我没半点力气，真是奇怪了。我一见到你，便如耗子见了猫，全身都酸软啦。」',
               'others_target' => '$N身子一斜，软答答的倒在$n的怀中，风情无限，娇羞不胜。'
             },
  'peace' => {
               'others' => '$N叫道：“大家有话好说，别动武，别动武！”',
               'others_target' => '$N对$n说道：“你这位$R，怎地如此狠霸霸的？我平生最不爱瞧人打架。”'
             },
  'ylove' => {
               'others' => '$N叹了口气，黯然唱道：“问世间情为何物，直叫生死相许。”',
               'others_target' => '$N幽然说道：“欢乐痛，离别苦。$n儿啊，你为何还要离我而去！”'
             },
  'shameless' => {
                   'others' => '$N对大家摇摇头，叹道：“你们都太不要脸了。”',
                   'others_target' => '$N对$n说道：“你这个人怎么脸皮比城墙拐弯儿还厚！”'
                 },
  'uandme2' => {
               'others' => '$N口中轻轻的念道：我的心中只有你！',
               'others_target' => '$N温柔的拉住$n的手，凝视着$n的双眼，深情无限的说道：我对你的爱，就象想皓皓明月，我将爱你直到永远。'
             },
  'brag' => {
              'others' => '$N把胸脯拍得噼啪响：“武林中拳头大的说话，有种的上来跟$s比划比划！”',
              'others_target' => '$N把胸脯拍得噼啪响，对$n咆哮：“武林中拳头大的说话，$r你有种上来跟$s比划比划！”'
            },
  'bite' => {
              'others' => '$N磨了磨牙。',
              'others_target' => '$N想狠狠地咬$n一口。'
            },
  'noshy' => {
               'others' => '$N顿足道：「都是你不好，教江湖上许多人都笑话于我。倒似我一辈子…一辈子没人要了，千方白计的要和你相好。你…你有什么了不起？累得我此后再也没脸见人。」忽然哇的一声哭了出来。',
               'others_target' => '$N对$n说道：「$n$c，害什么臊，这里没有外人，有话就说嘛。」'
             },
  'pei2' => {
              'others' => '$N缓缓的道：「今生我们不能在一起。我要在死了之后，天天陪着你。」',
              'others_target' => '$N温柔款款的搂着$n，轻声道：「$n，只要我能陪着你，就是没饭吃，没衣穿，天天受人打骂侮辱，我也是甘心情愿。」'
            },
  'eshen' => {
               'others' => '$N连连怪笑，道：「谁如不听我话，我喀喇一下，就扭断他的脖子。」 ',
               'others_target' => '$N跃到$n身边，摸摸$p后脑，捏捏$p手脚，又在$p的腰眼里用力掀了几下，裂开了一张嘴，哈哈大笑，道：「你真像我，真的像我！」 '
             },
  'old' => {
             'others' => '$N突然间老了数十年，原本洁白俊美的脸上，竟布满了一条条纵横交错的深深皱纹，满头浓密头发已尽数脱落。',
             'others_target' => '$N对$n道：「$n儿，你容貌一点也没有变，我却老了。」'
           },
  'slogan3' => {
                 'others' => '$N挺起胸膛，大声喊道：“为人民服务！”',
                 'others_target' => '$N对着$n挺起胸膛，大声喊道：“为人民服务！” '
               },
  'jianfa' => {
                'others' => '$N说道：「站着打，我不是你对手；坐着打，你不是我对手。我天天坐着练剑。」',
                'others_target' => '$N笑道：「这剑法就叫做『$N$n剑法』。嗯，这剑法中有我的名字，也有你的名字，将来传到后世，人人都知道是我们俩合创的。」'
              },
  'jump2' => {
               'others' => '忽然之间，$N高兴得跳了起来。',
               'others_target' => '$N胸口发热，脸上涌起了一阵红潮，翻身下马，叫道：「$n$c！」往$p怀中扑去。'
             },
  'soup' => {
              'others' => '$N低著头喝著一碗肉汤，鼻子浸到碗中，和汤里的肉块碰来碰去。',
              'others_target' => '$N佩上$n的剑，数著$n钱包里的银子，喝著一碗汤，汤上漂著几块肥肥白白的肉片。'
            },
  'monk2' => {
               'others' => '$N笑道：「你摸一摸我这光头，那也是滑不留手。」',
               'others_target' => '$N嫣然一笑：「我只道杀了$n之后，武林中便无油腔滑调之徒，从此耳根清净，不料。。。嘻嘻！」 '
             },
  'kiss10' => {
                'others' => '$N吓得全身发抖，道：「你……你……」',
                'others_target' => '$N伸手搂住了$n纤腰，只觉触手温软，柔若无骨，心中一动，便低头往$p唇上吻去。'
              },
  'nocry3' => {
                'others' => '$N拿手帕，安慰道：「乖孩子，别哭，别哭，过一会就不痛啦。」',
                'others_target' => '$N伸出左手，轻轻抚摸$n的秀发，强笑道：「别哭，别哭！我还有八十年好活呢，哪有这么快便去西天。」'
              },
  'careful' => {
                 'others' => '$N叹了口气，说道：如今这世道，唉！',
                 'others_target' => '$N对着$n劝道：走路防跌，吃饭防噎，你别太招摇了，当心有一天栽在人家手里！'
               },
  'hate4' => {
               'others' => '$N转身，怒道：「总有一天，教你死在我手里。」',
               'others_target' => '$N恨恨的道：「$n这$r，总有一日，将$p千刀万剐。」'
             },
  '18mo' => {
              'others' => '$N忽然唱起小调来：「一呀摸，二呀摸，摸到一位美人儿。美人脸蛋象瓜子，莫非你是老婊子？」口唱小调，双手乱摸。',
              'others_target' => '$N哼了一声，问$n道：「你会唱“十八摸”罢？唱一曲来听听。」'
            },
  'dontgo' => {
                'others' => '$N哽咽道：「大家别走，留下来陪陪我，好么？」',
                'others_target' => '$N哭哭啼啼的拉住$n的衣角，舍不得让$p走。'
              },
  'story' => {
               'others' => '$N问道：“谁能讲个故事？”',
               'others_target' => '$N对着$n使劲拍着巴掌：下面请$n讲故事，大家鼓掌欢迎！'
             },
  'huamei' => {
                'others' => '$N嫣然一笑，说道：“我的眉毛太淡，谁来给我画一画呢？“',
                'others_target' => '$N嫣然一笑，对$n轻轻地说道：“我的眉毛太淡，你给我画一画好吗？”'
              },
  'settle2' => {
                 'others' => '$N叫道：「咱们须得先成敌人，再做朋友，才算化敌为友。」',
                 'others_target' => '$N道：「$N和$n本来无怨无仇，根本不是敌人，既非敌人，这‘化敌’便如何化起？所以啊，要结成朋友，倒也不妨，要化敌为友，可无论如何化不来了。」'
               },
  'myfault' => {
                 'others' => '$N低声唱道：也许是我不懂的事太多，也许是我的错...',
                 'others_target' => '$N幽幽的对$n唱着：从未想过你我会这样结束，心中如此难过...'
               },
  'loveshoe' => {
                  'others' => '$N笑咪咪地举着一双绣花弓鞋，大声说道：哪位小姐的鞋掉了？',
                  'others_target' => '$N笑嘻嘻地拾起$n的绣鞋放在鼻边深深一闻，摇头赞道：好香！好香！'
                },
  'dream3' => {
                'others' => '$N柔声道：「昨晚上做了这个奇梦，今儿晚上又做，难道……难道，我真的和你是前世因缘么？」',
                'others_target' => '$N突然伸出手来，按住了$n的嘴，低声道：「你是我的梦中情$c，我叫你‘梦$c’，梦$c，你说这名字好不好？」'
              },
  'hugme' => {
               'others' => '$N心中忽然一动：「反正我就要死了，他也要死了。若是他来抱我，我决不会推开，便让他紧紧的抱着我。」',
               'others_target' => '$N神智迷糊，叫道：「$n$c，抱我，抱住我！」但觉燥热难当，要$n搂抱着方才舒服，便向$p扑去。'
             },
  'admire2' => {
                 'others' => '$N嘻嘻的道：「各位都是武林顶尖儿的高手，我$N一个也斗不过。」 ',
                 'others_target' => '$N躬身行礼，道：「久仰$n$R大名，无缘拜见，今日得睹芝颜，三生有幸。」 '
               },
  'woman' => {
               'others' => '$N皱了皱眉，唱道：这个女人哪～啊～啊～，不寻～～常！',
               'others_target' => '$N皱了皱眉，看着$n唱道：这个$R哪～啊～啊～，不寻～～常！'
             },
  'makeup' => {
                'others' => '$N翻箱倒柜拿出脂粉、眉笔、口红，准备化妆。',
                'others_target' => '$N边给$n化妆，边叹道：$c，你活着的时候就没打扮过，现在装殓前我给你好好打扮打扮。'
              },
  'ugly' => {
              'others' => '$N正颜道：男子汉大丈夫，第一论人品心肠，第二论才干事业，第三论文学武功，脸蛋儿俊不俊，有什么相干？',
              'others_target' => '$N望着$n忍俊不禁，纵声大笑道：你这不是癞蛤蟆想去吃天鹅肉吗？哈哈，笑死人了！'
            },
  'lie' => {
             'others' => '$N叹口气说道：「$s这辈子码头走得多了，什么样的江湖骗术没见过。 」',
             'others_target' => '$N向$n怒道：「你满口花言巧语，只骗得我一人，须骗不得别人。」'
           },
  'kiss7' => {
               'others' => '$N陶醉在长吻的甜味之中，登时忘却了身外天地。',
               'others_target' => '$N灵活的大眼睛转了几转，突然走上前去，抱住$n，在$p面颊上吻了一下。'
             },
  'nocry' => {
               'others' => '$N对自己说：“不许哭，不许哭。。。”可一个没忍住，眼泪流了一地。',
               'others_target' => '$N柔声对$n劝道：“不如意事常八九，你还是看开些吧，”说着就递上一张手绢。'
             },
  'accuse' => {
                'others' => '$N见大家手脚僵硬，表情木然，浑身散发金属光泽，不禁摇了摇头道：“唉, 都是机器人！”',
                'others_target' => '$N敲了敲$n的脑袋, 咚咚作响, 打开一看, 全是乱麻似的电线，不禁摇了摇头道：“这种机器人也太原始了！”'
              },
  'marriage4' => {
                   'others' => '$N正色道：「皇天在上，后土在下，我这一生一世，便是上刀山，下油锅，满门抄斩，男盗女娼，绝子绝孙，天打雷劈，满身生上一千零一个大疔疮，我也非娶你做老婆不可。」',
                   'others_target' => '$N扑的一声跪倒，说道：「我佛如来，阎王叛官，无常小鬼，大家请一起听了。我$N非娶$n$R为妻不可。就算我死后打入十八层地狱，拔舌头，万劫不得超生，那也没有什么，这个老婆总之是娶定了。」'
                 },
  'sing2' => {
               'others' => '$N快乐地唱着：我们是害虫，我们是害虫……',
               'others_target' => '$N对$n恶狠狠地唱：定要把害虫杀死，杀死！'
             },
  'nod4' => {
              'others' => '$N点了点头，道：「如此甚好。」',
              'others_target' => '$N依偎在$n的怀里，点头道：「$c说的不错。」'
            },
  'afraid' => {
                'others' => '$N害怕之极，说道：「我……我怕！」',
                'others_target' => '$N道：「$n$c，别说，别说，我怕得很。」'
              },
  'drinkcup' => {
                  'others' => '$N左手拿着条油腻腻的鸡腿往嘴里送，右手紧抓着盘子里的红烧狗肉，一边操起腰畔的牛皮酒袋咕都咕都的猛灌。',
                  'others_target' => '$N亲热把$n拉到一旁，笑咪咪地说道：走，咱哥俩喝一盅去！'
                },
  'slap3' => {
               'others' => '$N冷冷的道：「你们若再口出恶言，我$N每人给你们一个耳光。我是奸诈恶毒的坏人，说得出便做得到。」',
               'others_target' => '$N悲愤难抑，跨上一步，左右开弓，便是四记耳光。啪啪啪啪四声响过，$n两边脸颊登时红肿。'
             },
  'secret' => {
                'others' => '$N一脸狐疑地环视众人，说道：你们是不是有什么秘密不肯告诉我？！',
                'others_target' => '$N左右看了看，把$n拉到一旁悄声说道：来来来，我来告诉你一件事，你可千万不能对旁人说呀！ 这事可委实 ...，委实非同小可！！'
              },
  'papaya' => {
                'others' => '$N觉得自己笨的象只木瓜。',
                'others_target' => '$N对$n说道：你真是一只大笨木瓜。'
              },
  'sigh2' => {
               'others' => '$N忍不住叹道：「唉！」',
               'others_target' => '$N道：「$n$c为什么叹气，你不知道么？叹气，便是心有不足。$p长吁短叹，当然是为了另外的姑娘。」'
             },
  'sneer' => {
               'others' => '$N「哼」地冷笑一声。',
               'others_target' => '$N对着$n「哼」地冷笑一声。'
             },
  'hehe' => {
              'others' => '$N「嘿嘿嘿」奸笑了几声。',
              'others_target' => '$N对着$n「嘿嘿嘿」奸笑了几声。'
            },
  'miss4' => {
               'others' => '$N道：「我……这么久没见你了，你想我不想？」这几下低呼，当真是荡气回肠。',
               'others_target' => '$N低声道：「亲亲$n，我一直在想你，记挂着你。」'
             },
  'settle' => {
                'others' => '$N道：「你们以后不可寻仇生事，大家化敌为友如何？」',
                'others_target' => '$N道：「不向$n寻仇生事，那是可以的；说到化敌为友，却是不行，杀了我头也不行。」'
              },
  'wait' => {
              'others' => '$N一脸气极败坏，恶狠狠地说道：这事没这麽容易了结，你们都给我走着瞧！',
              'others_target' => '$N对$n抱拳说道：$R武功惊人，$S极是拜服，十年之後，再来领教！'
            },
  'old2' => {
              'others' => '$N头发一根一根的由黑变灰，再有灰转白。短短几个时辰中，宛似过了几十年，恐惧，忧愁，悔恨，失望，伤心，诸般心情夹攻，鬓边竟出现了无数白发！',
              'others_target' => '$N拿过一面镜子，放在$n面前，道：「你看你的头发！」 '
            },
  'welcome2' => {
                  'others' => '$N满脸欢笑，飞奔过来，叫道：我等了你这么久，我知道你终於会回来的。',
                  'others_target' => '$N甜甜一笑，眼中却流下泪来，说道：$n儿，是你，这不是做梦么？'
                },
  'handsome' => {
                  'others' => '$N笑嘻嘻地说道：各位仁兄的相貌真是俊美，骨骼清奇，身材魁伟，四肢修长，眉清目秀，目如朗星，精神饱满，都是行侠仗义的玉面英雄，英俊少……这个英俊中年。',
                  'others_target' => '$N指着$n说道：$R的相貌岂仅俊美而已，简直是风流潇洒，前无古人，后无来者。潘安退避三舍，宋玉甘拜下风。'
                },
  'giggle' => {
                'others' => '$N「咯咯咯」地笑了几声。',
                'others_target' => '$N对着$n「咯咯咯」地笑了几声。'
              },
  'invite' => {
                'others' => '$N忽然苦苦哀求起来：「求你跟我去啊，跟我去罢。你在我手背上这么狠狠的咬了一口，可是我一点也不恨你。我会一生一世的服侍你、体贴你，当你是我的主人。」',
                'others_target' => '$N伸出右手，按在$n手背之上，眼光中全是喜色，道：「$n$c，你喜不喜欢常常见见我，倘若我时时邀你到这儿来喝酒，你来不来？」'
              },
  'laughproud' => {
                    'others' => '$N摆出一张琴，抚出几下柔和的琴声，琴声宛如一股清泉在众人身上缓缓流过。$P清声唱道：“沧海一声笑，涛涛两岸潮，浮沉随浪谁记今朝。”',
                    'others_target' => '$N对着$n一拱手，朗声说道：“江湖之中，尔虞我诈，难得能遇你我这般侠胆忠心之人。你我合奏一曲《笑傲江湖》，意下如何？”'
                  },
  'aunt' => {
              'others' => '$N泪眼盈眶，叫道：姑姑，姑姑，你打我骂我杀我都可以，但千万别不理我呀！',
              'others_target' => '$N泪眼盈眶，对$n叫道：$c，$c，你打我骂我杀我都可以，但千万别不理我呀！'
            },
  'no' => {
            'others' => '$N大哭起来，娇嗔：「我不依，我不依！」',
            'others_target' => '$N轻笑道：「$n$c，我才不依呢，你就会哄骗人。」'
          },
  'slogan2' => {
                 'others' => '$N振臂高呼：“我们热爱侠客行，侠客行万岁！”',
                 'others_target' => '$N振臂高呼：“我们热爱$n，$n万岁！”'
               },
  'chase' => {
               'others' => '$N叫道：「大伙儿追啊！」',
               'others_target' => '$N抬起头来，只见对面站着的竟是自己日思夜想的情$c，欢叫一声，忽奔过去，投身入怀，喊道：「$n$c，我知道你一定会来追我的。我耐心等着，你终于来了。」'
             },
  'thumb' => {
               'others' => '$N竖起了右手大拇指。',
               'others_target' => '$N对着$n竖起了右手大拇指，好样的。'
             },
  'claw' => {
              'others' => '$N伸出长长的十根爪子，不怀好意的呵着气。',
              'others_target' => '$N飞起一爪，挠了$n个满脸开花！'
            },
  'cry3' => {
              'others' => '$N哭道：「你欺负人，大人打小孩，好不要脸，唉唷好痛，呜呜呜，呜呜呜呜！」',
              'others_target' => '$N嘴一扁，哇的一声，哭了出来，将脸藏在$n怀里。'
            },
  'wrong' => {
               'others' => '$N道：「错了，错了！」',
               'others_target' => '$N道：「$n$R，这全是一场误会，你怎地当真了？」'
             },
  'sing' => {
              'others' => '$N愉快地唱起歌来。',
              'others_target' => '$N对着$n愉快地唱起歌来。'
            },
  'kick5' => {
               'others' => '$N双脚在空中乱踢，一双泥足瞎伸乱撑，模样要有多难看就有多难看。',
               'others_target' => '$N在$n屁股上轻轻踢了一脚，笑道：「傻$c，还不给我快滚！」'
             },
  'nothreat' => {
                  'others' => '$N说道：「我$N堂堂男子汉，决不受人胁迫。」 ',
                  'others_target' => '$N说道：「倘偌$n这$r仗着人多势众，硬要我做这做那，$N死就死了，决不依从。」 '
                },
  'addoil' => {
                'others' => '$N憋足了劲大喊：大伙儿加油挖啊！ 泥巴下面就是宝贝了！',
                'others_target' => '$N冲着$n大喊：$R，加油，加油！'
              },
  'address' => {
                 'others' => '$N目中含情脉脉，双颊晕红，低声道：「你叫我什么？」 ',
                 'others_target' => '$N颇感不好意思，道：「我冲口而出，$n$c，你别见怪。」 '
               },
  'goodkid' => {
                 'others' => '$N对大家说：“叔叔阿姨们，我给大家唱支《我是一个乖宝宝》好不好？”',
                 'others_target' => '$N拍了拍$n的头，说：“好孩子，听话，乖。”'
               },
  'zzz' => {
             'others' => '$N睡着了，呼噜打得震天响。',
             'others_target' => '$N在$n的身边睡着了，呼噜打得震天响。'
           },
  'drug' => {
              'others' => '$N提著小竹篮，背著小扁担，沿街叫卖:\\',
              'others_target' => '$N悄悄地把一包砒霜放在$n的腊八粥里，躲在一旁，喜滋滋地看著他喝了下去。'
            },
  'escape' => {
                'others' => '$N脚底抹油，一声不吭地溜了。',
                'others_target' => '$N一边跑，一边对着$n大声喊道：\\'
              },
  'sorry' => {
               'others' => '$N对所有在场的人表示歉意。',
               'others_target' => '$N痛哭流涕的哀求$n的原谅。'
             },
  'nohero' => {
                'others' => '$N感动地叫道：「为人不玩侠客行，就称英雄也枉然！」',
                'others_target' => '$N由衷赞叹道：「为人不识$n，就称英雄也枉然！」'
              },
  'goodbye' => {
                 'others' => '$N凄婉地说道：“世上没有不散的宴席，我先走一步了，大家保重。”',
                 'others_target' => '$N看着$n离去的背影，不禁黯然神伤。留声机里飘出邓丽君的歌声：“今宵离别后，何日君再来？......”'
               },
  'congra2' => {
                 'others' => '$N沉吟道：「弃暗投明，可敬可佩！」',
                 'others_target' => '$N说道：「恭喜，恭喜。$n$R弃暗投明，好得很啊。」'
               },
  'praise' => {
                'others' => '$N伸出指头把大家挨个点了一遍：“高手，都是高手！” ',
                'others_target' => '$N指着$n赞叹道：“$n是武林第一高手！”'
              },
  'fuma' => {
              'others' => '$N说道：「你相貌堂堂，威风凛凛，何不到灵州去做附马？那位如花似玉的公主若是叫旁人得了去，岂不可惜？」',
              'others_target' => '$N喝得微醺，对$n道：「好孩子，我赐你一件我最宝贵的物事。从明天起，你是我的金刀驸马。」'
            },
  'nocry4' => {
                'others' => '$N「哇」的一声，惊哭出来，叫道：「妈妈，妈妈！」',
                'others_target' => '$N轻拍$n的肩膀，安抚$p道：「别哭，别哭！妈妈就来了！妈妈就来了！」'
              },
  'moon' => {
              'others' => '$N轻轻叹了囗气，说道：「天上月亮这样圆，又这样白。」',
              'others_target' => '$N色迷迷的道：「$n$c，你身上有些东西，比天上月亮更圆更白。」'
            },
  'thank' => {
               'others' => '$N对所有在场的人表示感谢。',
               'others_target' => '$N对$n表示衷心的感谢。'
             },
  'shake2' => {
                'others' => '$N满脸紫胀，摇了摇头。',
                'others_target' => '$N摇头叹道：「$n你这$r，实在也太不成器！」 '
              },
  'disapp' => {
                'others' => '$N满含失望地长叹一声，说道：既然如此，也就罢了！',
                'others_target' => '$N一把鼻涕一把眼泪地哭着，对$n骂道：你这麽没出息，叫我怎么对得起你死去的爹娘啊！'
              },
  'protect3' => {
                  'others' => '$N说道：「我要让你平安喜乐，忘了从前的苦处，不论有多少人欺侮你，跟你为难，我宁可自己性命不要，也要保护你周全。」',
                  'others_target' => '$N对$n说道：「从今而后，我会尽力爱护你，照顾你，不论有多少人来跟你为难，不论有多么厉害的人来欺侮你，我宁可自己性命不要，也要保护你周全。我要使你心中快乐，忘去了从前的苦处。」'
                },
  'support' => {
                 'others' => '$N高声喊道：“支持我的人，请站出来！”',
                 'others_target' => '$N挤出人群，大声道：我，我支持$n！！！'
               },
  'oath' => {
              'others' => '$N庄严宣告：“要消灭一切害人虫，全无敌！”',
              'others_target' => '$N搂住$n，指着初升的月亮说：“天上明月，是我们的证人。”'
            },
  'sword' => {
               'others' => '$N笑道：「我这一招叫作“无双无对，$N一剑”，天下无敌，你怎有破解的法门？」 ',
               'others_target' => '猛地里$N一剑挺出，直刺$n心口，当真是捷如闪电，势若奔雷。'
             },
  'bye' => {
             'others' => '$N抱拳道：“青山不改，绿水常流，咱们后会有期！”',
             'others_target' => '$N对$n抱拳道：“青山不改，绿水常流，咱们后会有期！”'
           },
  'hug4' => {
              'others' => '$N笑道：「你辛苦了一晚，我抱你上床去。」说着伸手便抱。',
              'others_target' => '$N拦腰将$n抱住，右手抄到$p脚弯里，将$p横着抱起，放到自己床上。'
            },
  'angry' => {
               'others' => '$N很生气地撅了撅嘴。',
               'others_target' => '$N很生气地看着$n。'
             },
  'pregnant' => {
                  'others' => '$N道：「咱们要是生个男孩，那就叫小$N。可别像你这般刁钻古怪才好。」',
                  'others_target' => '$N拍了拍$n的肚子，悄问$p：「有几个月啦？我怎不知道？」'
                },
  'cool' => {
              'others' => '$N道：「幸亏你肚子大了，否则的话，你爹怎麽肯把你嫁给我这穷小子？那时候哪，我巴不得你肚子快大！」 ',
              'others_target' => '$N细看$n脸，见$p容色憔白，瘦了许多，微笑道：「为什麽瘦了？天天想着我，是不是？」'
            },
  'care' => {
              'others' => '$N胀红了脸，道：「只要在你身边，什么危险我都不在乎。你带我去吧！」',
              'others_target' => '$N走到$n的面前，说道：「$n$c，你一直待我很好，难道我不知道么？难道我是个忘恩负义，不知好歹的人吗？」'
            },
  'ugly2' => {
               'others' => '$N美丽的眼睛，美丽的鼻子，美丽的嘴巴，突然都变得歪歪扭扭，变得象妖魔一样。',
               'others_target' => '$N说道：「$n$c，容貌及得上心么？在我心中，你比从前更加美上十倍，百倍。」'
             },
  'sorry4' => {
                'others' => '$N柔声认错，道：「我不该说这些话，是我的不是，你别见怪。」',
                'others_target' => '$N柔声对$n说道：「$c你别生气，是我的不是。」'
              },
  'ysis' => {
              'others' => '$N说：“各位美眉好呀！”',
              'others_target' => '$N对$n说：“$n美眉好呀！”'
            },
  'nun2' => {
              'others' => '$N说道：「阿弥陀佛，起这种念头，也不怕菩萨嗔怪。」 ',
              'others_target' => '$N叹道：「$n$c，我身入空门，六根清净，再动凡心，菩萨自然要责怪了，怎么会怪到你？」 '
            },
  'yawn' => {
              'others' => '$N困得眼睛都睁不开了，迷迷糊糊地打了个哈欠。',
              'others_target' => '$N对着$n打了个哈欠，熏得$n昏昏欲睡。'
            },
  'woman2' => {
                'others' => '$N低声道：「孩儿，你长大了之后，要提防女人骗你，越是好看的女人越会骗人。」',
                'others_target' => '$N和$n正面相对，手足忍不住轻轻颤抖，忙低下了头，不敢看$p，本来是全无血色的脸，蓦地里涨得通红。'
              },
  'joycup' => {
                'others' => '$N高举酒盏，大声说道：今天$S我特别高兴，各位在座嘉宾，瞧得起我的就干了这一杯！',
                'others_target' => '$N满满地斟上一杯葡萄美酒，抿了一口，斜眼看着$n把酒杯递过去挑逗道：$c若有意，就干了这半杯残酒。'
              },
  'robot' => {
               'others' => '$N高声叫道：“报告巫师，这里发现一群机器人。”',
               'others_target' => '$N一把揪住$n的衣领高声叫道：“报告巫师，这里发现机器人$n一名。”'
             },
  'heart' => {
               'others' => '但见她的身形微晃，宛似晓风中一朵荷蕖，背影婀娜，姿态美妙，一阵风般掠过雪地。$N的心嘭嘭直跳：如果她肯回头看我一眼，我就肯为她而死。',
               'others_target' => '$N笑嘻嘻地对着$n说：快把我的心还给我！'
             },
  'sue' => {
             'others' => '$N仰天长叹道：「难道这个世道竟然没有王法，天理何在啊？！ 」',
             'others_target' => '$N对$n喝道：「$r，你竟敢杀人，我要去官府告你！！！ 」'
           },
  'pk' => {
            'others' => '$N用手摸了摸“咕咕”叫的肚子，心说：“今天天气这么好，干脆再来个‘扬州十日’吧！”不知不觉中口水流了出来。',
            'others_target' => '$N凛然道：“$s一生杀过二百三十一人，个个都是大奸巨恶、负义薄幸之辈。$N贪饮贪食，贪花好色，可是生平从来没杀过一个好人。$n，你个$r是第二百三十二人！”'
          },
  'cry' => {
             'others' => '$N嚎啕大哭起来。',
             'others_target' => '$N越想越伤心，终于忍不住趴在$n的肩膀上放声大哭起来。'
           },
  'lag' => {
             'others' => '$N不停地敲打键盘：“天哪，我变慢了！”',
             'others_target' => '$N不停地敲打着$n的头，嚷着：“天哪，我变慢了！”'
           },
  'hug3' => {
              'others' => '$N温柔地抱起所有在场的人，温柔地放进石棺里，温柔地合上棺盖。',
              'others_target' => '$N温柔地抱起$n，温柔地把$p放进石棺里，温柔地合上棺盖。'
            },
  'kick2' => {
               'others' => '$N笑逐颜开，叫道：「你又在玩什么古怪花样啦？我踢你的屁股！」',
               'others_target' => '$N飞出一腿，踢中了$n的后臀。这一腿又快又准，巧妙之极。$n站立不定，直滚下楼去。'
             },
  'nolie' => {
               'others' => '$N道：「你想，我一心一意要让你孙子叫我做爷爷，今天倘若骗了你，你儿子都不肯叫我爹爹，还说什么孙子？」',
               'others_target' => '$N道：「$n$c，普天下我人人都骗，只不骗你一个。这叫做大丈夫一言既出，死马难追。小妻子一言不发，活马好追。」'
             },
  'bye2' => {
              'others' => '$N说道：「叨扰了，再见罢。」 ',
              'others_target' => '$N道：「$n$R，咱二人孤男寡女，深宵共处，难免要惹物议。你快请罢！」'
            },
  'myname' => {
                'others' => '$N轻轻的道：「我叫做‘$N’。说给你听了，也不知你以后会不会记得。」',
                'others_target' => '$N对着$n摇头道：「$R生得像天仙一般，我连$R叫甚么名字也不知道。」'
              },
  'fox' => {
             'others' => '$N微笑道：「我是千年狐狸精，道行很深，没尾巴的。」 ',
             'others_target' => '$N心中犯疑：「莫非$n是狐狸精？」 转到$p身后瞧了瞧。'
           },
  'why' => {
             'others' => '$N皱皱眉问道：「为什么啊？」',
             'others_target' => '$N拉着$n的手问道：「好$c，告诉我为什么吧。」'
           },
  'die3' => {
              'others' => '$N道：「还没给你气死，总算还好。」',
              'others_target' => '$N向$n视了一眼，冷笑道：「你还没死啊？$s的事，也用得着你来多嘴多舌？走过来让我瞧瞧，怎么到今天还不死？」'
            },
  'quick' => {
               'others' => '$N厉声喝道：「快些，快些！」',
               'others_target' => '$N叫道：「$n，你还不快来，啊哟，我……我……」'
             },
  'nobeg' => {
               'others' => '$N说道：「人家心中想给你，你不用求，人家自然会给你；人家不肯，你便是苦苦哀求也是无用，反而惹得人家讨厌。」',
               'others_target' => '$N说道：「$n，你这一生一世，可别去求人家什么。」'
             },
  'ah' => {
            'others' => '$N惊讶地「啊！」了一声。',
            'others_target' => '$N对着$n惊讶地「啊！」了一声。'
          },
  'sweat' => {
               'others' => '$N笑吟吟从怀里摸出了一块手帕，打了两个结，抛掷了过去，叫道：「擦擦汗吧。」',
               'others_target' => '$N嫣然一笑，摸出一块手帕，给$n抹去满额汗水，道：「大雪地里，出了汗不抹去，莫著了凉。」'
             },
  'hero2' => {
               'others' => '$N大喊一声：留得青山在，不怕没柴烧。你们先撤，我掩护。',
               'others_target' => '$N对$n小声嘀咕道：君子报仇，十年不晚！ 五年后你再来找他吧。'
             },
  'know' => {
              'others' => '$N冷眼看着那滚滚红尘，幽然长叹：“知我者谓我心忧，不知我者谓我何求？”',
              'others_target' => '$N激动得泪如泉涌，握住$n的手说道：“生我者父母，知我者$n！”'
            },
  'sigh' => {
              'others' => '$N深深地叹了口气。',
              'others_target' => '$N叹了口气，说道：“$n再也不是以前的$n了。”'
            },
  'sigh5' => {
               'others' => '$N轻轻叹了口气，叹息声却很温柔。',
               'others_target' => '$N唉声叹气地说道：「唉，$n你打不过人家，就该磕头求饶啊，白白地挨一顿揍，不冤么？」'
             },
  'kick' => {
              'others' => '$N飞起一脚，似乎在踢苍蝇。',
              'others_target' => '$N飞起一脚，正好踢中$n的屁股！'
            },
  'club' => {
              'others' => '$N晃动着手中的木棒，到处寻找目标。',
              'others_target' => '$N手舞木棒，对准$n的后脑一记闷棍，$n哼也没哼一声，软软的摔倒在地。'
            },
  'flatter' => {
                 'others' => '$N欣欣然，仰头上天，一副等着别人来拍马屁的样子。',
                 'others_target' => '$N指着$n赞颂道：“$n武功当世固然无人可比，就连放个屁也需大声呼吸，衷心赞颂！”'
               },
  'consider' => {
                  'others' => '$N开始认真考虑这个问题。',
                  'others_target' => '$N开始考虑是否要杀了$n。'
                },
  'vomit' => {
               'others' => '$N突然满脸通红，随即又变惨白，身子颤了几下，忽然抚住小腹，喉头喔喔作声，呕了不少清水出来。',
               'others_target' => '$N脸上一阵红一阵黑，不住呕吐在$n身上。'
             },
  'kiss1' => {
               'others' => '$N吹了一声响亮口哨，接著向在场的每一位女士打了个飞吻！',
               'others_target' => '$N轻轻地走了过去，从背後搂著$n的纤纤细腰，接著低下头来，深深地吻着$p的红唇。'
             },
  'nod3' => {
              'others' => '$N点头道：「了不起，了不起！」',
              'others_target' => '$N点头道：「$n$R之言不错。」'
            },
  'ghostlove' => {
                   'others' => '$N轻轻说道： “ 牡丹花下死，作鬼也风流。”',
                   'others_target' => '$N在$n耳边轻轻呵了一口气，说道： “$n刀下死，作鬼也风流。”'
                 },
  'shrug' => {
               'others' => '$N无奈地耸了耸肩。',
               'others_target' => '$N对着$n无奈地耸了耸肩。'
             },
  'regard' => {
                'others' => '$N叹了口气道：“你当我是谁呀，我也是苦出身！”',
                'others_target' => '$N对着$n嚷道：“你当你是谁呀，你以为你是小龙女呀？”'
              },
  'zzz1' => {
              'others' => '$N静静地睡着了。',
              'others_target' => '$N觉得困倦极了，倒在$n怀里静静地睡着了。'
            },
  'xmas' => {
              'others' => '$N找出一只硕大无比的袜子挂在床头，一边装睡一边默默嘀咕着：“圣诞老人呀，我要十只金元宝，我要一堆菩提子...”。',
              'others_target' => '$N一看到$n，眼睛立刻发出＄＄＄的耀眼光彩，甜甜地说一声“圣诞快乐”，然后两手一摊，等着$n派礼物。'
            },
  'lanlan1' => {
                 'others' => '$N面露怯色，好像害怕什么，不觉说道：“就算你是兰兰，我可不是二皮风喔！” 说完脚底抹油，转身一溜烟跑了。',
                 'others_target' => '$N指着$n嚷道：“你当你是谁，你以为你是兰兰啊？”'
               },
  'comfort2' => {
                  'others' => '$N转头道：「你这么凶霸霸吓唬孩子干嘛？」',
                  'others_target' => '$N轻轻拍$n的背心，安慰$p道：「别怕，别怕！乖孩子，别怕。」'
                },
  'uncle' => {
               'others' => '$N暗暗的想：“ 我是谁的叔叔呢？”',
               'others_target' => '$N一脸气急败坏的对$n大叫道：“看清楚点，我是你叔叔，不是姑姑。”'
             },
  'flirt' => {
               'others' => '$N贼忒嘻嘻地紧盯着人堆里的大姑娘们，嘴里不干不净地嘟囔着。',
               'others_target' => '$N贼忒嘻嘻地盯着$n，一边走过去挨挨蹭蹭，一边嘴里乱叫：我的亲亲小宝贝儿哟！'
             },
  'agree' => {
               'others' => '$N说：「你们大家都对，其实$s也是这么想的。」',
               'others_target' => '$N对$n说：「$R所言极是，与$C心有灵犀，不谋而和。」'
             },
  'love' => {
              'others' => '$N觉得这个泥潭真美好，人人充满了爱心，不禁唱出声来：“爱是ＬＯＶＥ，爱是ＡＭＯＲ，爱是ＲＡＫ，爱是人类最美丽的语言，爱是$N无私的奉献。”',
              'others_target' => '“呜呜噢噢耶耶，”$N害羞地瞟了一眼$n唱道：“我爱你在心口难开。”'
            },
  'poem' => {
              'others' => '$N拔剑长吟道：“十年磨一剑，霜寒未曾试。今日把问君，谁有不平事？”',
              'others_target' => '$N拔剑指着$n，长吟道：“十年磨一剑，霜寒未曾试。今日把问君，谁有不平事？”  '
            },
  'wave' => {
              'others' => '$N挥了挥手。',
              'others_target' => '$N对着$n挥了挥手。'
            },
  'sword3' => {
                'others' => '$N笑道：「你一剑没刺正心口，我便知你对我暗有情意 了。」',
                'others_target' => '$N倚在$n的怀里，说道：「我刺你一剑，你难道不恨我么？」'
              },
  'sjsz' => {
              'others_target' => '$N对$n拱手说道：“这位$R说什么‘先诛少林，后灭武当’，不若你我在试剑山庄煮酒论剑，生死为注，一较高下如何？”'
            },
  'sweat3' => {
                'others' => '$N只觉眼前金星乱冒，额上黄豆大的汗珠一粒粒的渗了出来。',
                'others_target' => '$N从身边摸出一块绿绸手帕，缓缓替$n拭去额头的汗水和泥污。'
              },
  'candy' => {
               'others' => '$N忙道：「乖，听话，$s买糖糖给你吃。」',
               'others_target' => '$N说道：「我的脾气很执拗，$n$c是我第一个喜欢的糖人儿，我再也不喜欢第二个了。」 '
             },
  'hi2' => {
             'others' => '$N笑道：「那日一别，不意又在此处相遇，别来无恙。」 ',
             'others_target' => '$N见$n衣衫单薄，当下脱下貂裘，披在$p身上，说道：「$c，你我一见如故，请把这件衣服穿了去。」'
           },
  'visit' => {
               'others' => '$N朗声说道：拜山拜水拜码头，$S初到宝地，还请各位老大们多多关照！',
               'others_target' => '$N对$n说道：$c在上，$C初到码头，人生地不熟，万事请多关照！'
             },
  'hate' => {
              'others' => '$N看着这个肮脏的泥潭，人人心怀鬼胎互相倾轧，心中充满了仇恨和不屑。',
              'others_target' => '$N鄙夷地看着$n，恨不得把$p大卸八块生吞活剥。'
            },
  'protect' => {
                 'others' => '$N拍着胸脯打包票：放心，天塌下来有我顶着，你们都不用怕！',
                 'others_target' => '$N对著$n把胸脯拍得震天响：有$S我在，什么人都不能从你那儿讨了好去！'
               },
  'nolaugh' => {
                 'others' => '$N大喝一声：「不许笑，$s叫你不许笑，就不许笑！ 」',
                 'others_target' => '$N脸也一板道：「$s最听女人的话，$n贤$c说不许笑，我就不笑。」'
               },
  'good' => {
              'others' => '$N心想：「我这一生要多做好事，不做坏事。巨象可负千斤，蝼蚁仅曳一芥，力大则所做好事亦大，以$s的本领，若是专做好事，岂非造福不浅？」',
              'others_target' => '$N心中暗道：「$n本来是个穷凶极恶的$r，突然改做好事，不免有点不自量力......」'
            },
  'doufu' => {
               'others' => '$N有的是一颗去吃豆腐的心，两支作好了准备的手！',
               'others_target' => '$N深情地对$n唱道：走千山万里路，读千册万卷书，都不如靠近吃你两块豆腐！'
             },
  'birthday' => {
                  'others' => '$N睁开明亮的双眼，展现令人心动的笑容，痴痴地说：「知道今天是我的生日吗？」',
                  'others_target' => '$N对着$n大声欢唱：「祝你生日快乐～祝你生日快乐～祝你生日快乐～祝你生日快乐～」'
                },
  'story2' => {
                'others' => '$N道：「从前，有一个老公公，在山里行走，看见有一只狼，给人缚在一只布袋里，那狼求他释放，老公公便解开布袋，将狼放了出来，那狼……」',
                'others_target' => '$N嫣然一笑，道：「$n$c，你讲几个故事给我听，兔哥哥也好，狼婆婆也好，我就睡着了。」'
              },
  'meeting' => {
                 'others' => '$N高声宣布：“今天，我们要召开一个关於侠客行的常务工作会议！”',
                 'others_target' => '$N大声宣布：“现在开会！本次会议重点讨论关於$n同志最近的生活作风问题！”'
               },
  'coolmonk' => {
                  'others' => '$N唱到：「小和尚下山去化斋，老和尚有交待：山下的女人是老虎，看见一定要躲开。」',
                  'others_target' => '$N拉住$n右手，提了起来，在$p手背上轻轻一吻，笑道「傻$c，相公做和尚是假的。」'
                },
  'sure' => {
              'others' => '$N连忙说道：“见得，见得，大大的见得！”',
              'others_target' => '$N对着$n微笑道：“不见得吧？”'
            },
  'jianfa2' => {
                 'others' => '$N笑道：「这套茅厕剑法姿势难看，可是十分厉害。$N和一些旁门左道的高手谈论，大家认为除了东方教主之外，天下无人能敌。」',
                 'others_target' => '$N斜眼向着$n道：「$n$R，你这坐着打天下第二的剑法，我看也是稀松平常！」'
               },
  'comfort' => {
                 'others' => '$N安慰众人道：天道不测，世事难言，一切岂能尽如人意？你们都不要太伤心了。',
                 'others_target' => '$N轻轻的替$n擦干眼泪，柔声说道：面包会有的，一切都会有的。'
               },
  'shake3' => {
                'others' => '$N笑道：「原来你名叫摇头猫，这名字可不大好听哪。」',
                'others_target' => '$N对$n笑道：「嗯，你只是摇头，我只好给你取个名字了。你叫做『$N门摇氏』吧！」'
              },
  'pretty' => {
                'others' => '$N看看这个，瞧瞧那个，想不到世间竟有这般粉装玉琢似的姑娘，不觉呆了。',
                'others_target' => '$N指着$n赞叹道：$n是武林绝世无匹的美女！'
              },
  'mistake' => {
                 'others' => '$N道：「便是圣人，也有做错事的时候。我从小没爹娘指导，难保不会一时胡涂。」',
                 'others_target' => '$N侧过身子，望着$n的脸，说道：「要是我做错了甚么事，得罪了你，你会打我、骂我、杀我么？」'
               },
  'hurt2' => {
               'others' => '$N尖叫道：「别……别……这么多血，求求你……」',
               'others_target' => '$N喘了一会气，对$n说道：「你……你为甚么这样？你这样做，好伤自己身子。」'
             },
  'hot' => {
             'others' => '$N叫道：「好热，好热！」嗤的一声，撕开了自己衣衫。',
             'others_target' => '$N说道：「$n$R，这几日天气好热，你老人家身子好罢？」'
           },
  'slapsb' => {
                'others' => '$N高声叫骂：又是哪个王八蛋在造谣？要让$s找到了非煽他几个嘴巴不可！',
                'others_target' => '$N对着$n怒目而视：是不是又是你这个$r在造谣？看$s掌你嘴！'
              },
  'nofear' => {
                'others' => '$N两眼一翻说到：“傻的怕横的，横的怕楞的，楞的怕不要命的，$s不要命，你们能把我怎麽样？”',
                'others_target' => '$N满怀柔情的对$n愉快地唱道：我不想活了你也别想过，我就专门跟您搅活！'
              },
  'face2' => {
               'others' => '$N微微一笑，扮个鬼脸，一副天真烂漫的模样，笑容说不出的动人。',
               'others_target' => '$N斜过身子，伸出舌头，左眼闭，右眼开，脸上肌肉扭曲，向$n扮个极怪的鬼脸。'
             },
  'monk' => {
              'others' => '$N说道：「$s已为你做了和尚，非娶你不可，倘若菩萨责怪，那就只能怪我。」',
              'others_target' => '$N叹道：「$N削发为僧，从此身入空门。$n施主，咱们就此别过。」 '
            },
  'slash' => {
               'others' => '$N舞了个刀花。',
               'others_target' => '$N怒火中烧，一刀把$n劈成两半!'
             },
  'smile4' => {
                'others' => '$N仰天惨笑，脸上露出诡异的笑容。',
                'others_target' => '$N一双水汪汪的眼睛便如要滴出水来，似笑非笑、似叶非叶的斜睨着$n。'
              },
  'lean' => {
              'others' => '$N只觉得全身懒慵慵的没有一丝力气，好想找个人靠着。',
              'others_target' => '$N幸福地靠在$n的怀里。'
            },
  'roll' => {
              'others' => '$N倒在地上，像一根大木柱般直滚到一扇门边，咕碌碌的便滚了出去。',
              'others_target' => '$N大声说道：「$n，你这点微末功夫，休在$s面前班门弄斧。我不许你说一句话，快快给我滚了出去。」'
            },
  'beg1' => {
              'others' => '$N说道：「你答允我，永远永远，不可损伤自己。」',
              'others_target' => '$N说道：「$n$c，我求你一件事，你肯答允么？」'
            },
  'taoyan' => {
                'others' => '$N努起小嘴，娇声娇气地说了一声，“讨厌！”',
                'others_target' => '$N用手指着$n的鼻子，一边笑一边骂道，“你好坏！好坏！”'
              },
  'kick4' => {
               'others' => '$N气得伸足乱踢，只踢得地上的白雪飞溅。',
               'others_target' => '$N在$n屁股上踢了一脚，将$p踢得几个斤斗翻将出去，砰的一声，撞在墙上。'
             },
  'chitchat' => {
                  'others' => '$N笑呵呵地对大伙一抱拳，说道：今天这个，... 这个天气真好！',
                  'others_target' => '$N朝着$n一抱拳，说道：哈哈哈，这个，今天，... 这个天气真好！'
                },
  'flower' => {
                'others' => '$N贼头贼脑地看了看周围没人，晃着脑袋流里流气地哼哼着：路边的野花，你不要采啊。。。不采白不采！',
                'others_target' => '$N满面怒容地对$n大声喝道：你个不要脸的$r，离我的花远点！'
              },
  'notouch' => {
                 'others' => '$N道：「哼，你这人哪，十四五岁的小姑娘，七八十岁的老太婆都是来者不拒……」',
                 'others_target' => '$N喝道：「别碰$n身子，你这人太也好色，靠不住得很。」'
               },
  'faint2' => {
                'others' => '$N气得手足冰冷，险些晕去。',
                'others_target' => '$N笑道：「说不定是$n有羊吊病，突然发作，人事不知。」'
              },
  'enough' => {
                'others' => '$N说道：「够了，够了！真是太多太多了叻…… 」',
                'others_target' => '$N红着脸，对$n低声说道：「$n$c，你给我的爱那么多，让我永生永世都享受不尽！」'
              },
  'marriage2' => {
                   'others' => '$N慢慢站起身来，道：「我快死了，就是不死，我也决不能嫁你。但是我很喜欢听你刚才跟我说过的话。你别恼我，有空的时候，便想我一会儿。」这几句话说得很温柔，很甜蜜。',
                   'others_target' => '$N伸出手，握住了$n右手，大声道：「$R，我诚心诚意，愿娶你为妻，只盼你别说我不配。」'
                 },
  'raise' => {
               'others' => '$N大声说道：“赞成的人，请举手！”',
               'others_target' => '$N高举双手，对$n激动地认同道：“好主意！真是个好主意呀！”'
             },
  ':P' => {
            'others' => '$N伸了伸舌头，裂嘴又笑了笑。',
            'others_target' => '$N向$n扁扁嘴，伸伸舌头，模样可爱极了！'
          },
  'en' => {
            'others' => '$N有一搭，没一搭的“嗯”了一声。',
            'others_target' => '$N漫不经心的“嗯”了一声，似乎根本没在听$n说什么。'
          },
  'touxi' => {
               'others' => '$N哈哈一笑，说道：「我偷袭得手，虽然杀了你，谅你死得不服。」 双掌一撤，退了三步。',
               'others_target' => '$N对$n喝道：「$r，你还要不要命？」双掌已按住$p胸口，冷冷的道：「我内力一吐，教你肋骨尽断。」'
             },
  'lover' => {
               'others' => '$N慨然长叹：“人生不相见，动如参与商。今夕复何夕，共此灯烛光....”',
               'others_target' => '$N转过身来，轻轻揭开罩在$n脸上的霞帔。$n嫣然一笑红烛照映之下,当真是人美如玉。'
             },
  'bow' => {
             'others' => '$N躬身作了个揖。',
             'others_target' => '$N对着$n躬身作了个揖。'
           },
  'away' => {
              'others' => '$N提刀在空中虚劈，呼呼生风，厉声道：「你再不走，可休怪我无情！」 ',
              'others_target' => '$N对$n哼了一声，道：「你给我立刻走开，走得远远地，再也不许见我的面。倘若再给我见到，定然挖出你的眼珠子。」 '
            },
  'stuff' => {
               'others' => '$N拍拍肚子，\\',
               'others_target' => '$N\\'
             },
  'benger' => {
                'others' => '$N用手指弹了一下自己的脑门儿。',
                'others_target' => '$N在$n的头上弹了个清脆的脑崩儿，$n的脑门儿上立刻长出了个小臌包。'
              },
  'grandma' => {
                 'others' => '$N好想念外婆的糖果啊。。。',
                 'others_target' => '$N贼兮兮的对$n问道：要买蒙汗药麽？外婆牌的，保质保量。'
               },
  'killing' => {
                 'others' => '$N目光中杀气大盛，恶狠狠的道：「这是你自取其死，可别怪我。」 ',
                 'others_target' => '$N大叫：「你要杀人，便来杀我，休得伤我的$n$c。」 '
               },
  'ugly4' => {
               'others' => '$N道：「你当真不嫌我容貌丑陋，愿意和我一辈子厮守？」',
               'others_target' => '$N笑道：「$n，连丑八怪的乡巴佬也不要你，你活在世上有甚么味儿？还不如就在石头上撞死了罢。」'
             },
  'dunno' => {
               'others' => '$N摇了摇头，不知道。',
               'others_target' => '$N对着$n说：对不起，我不知道。'
             },
  'chess' => {
               'others' => '$N解下背上棋盘，摸出囊中棋子，别的倒没想甚麽，就祗想找人下棋。',
               'others_target' => '$N朝$n说道：「比剑嫌霸道，琴音无法比拚。$R要是高兴，咱们便来下一局棋如何？」'
             },
  'admire' => {
                'others' => '$N抱拳团团一拜，讨好地说道：$S对各位的景仰之情，有如滔滔江水连绵不绝。',
                'others_target' => '$N双手抱拳，讨好地对$n说道：$S对$R的景仰之情，有如滔滔江水连绵不绝。'
              },
  'joythank' => {
                  'others' => '$N大声说道：各位父老乡亲，大哥大嫂，少爷奶奶，小猫小狗，$S在此多谢了！',
                  'others_target' => '$N乐不可支，点头哈腰，一叠声说道：多谢$n$R，小的这辈子不会忘了您老的好处！'
                },
  'gun' => {
             'others' => '$N很牛逼地掏出一把五四式手枪。',
             'others_target' => '$N很牛逼地掏出一把五四式手枪，“砰”一枪把$n撂倒了。'
           },
  'faint' => {
               'others' => '$N口吐白沫，昏了过去。',
               'others_target' => '$N被$n气得昏了过去。'
             },
  'protect2' => {
                  'others' => '$N一时止不住哭，过了一会儿才道：没人欺负我，是我生来命苦。我自己又不好，心里想一个人，总是放他不下。',
                  'others_target' => '$N见$n肩头起伏，纤腰如蜂，楚楚可怜，低声道：$n$c，是谁欺负你了？等$C神功大成之后，我去给你出气。'
                },
  'dead' => {
              'others' => '$N身子晃也不晃，一歪便跌倒在地，扭曲了几下，便即不动。',
              'others_target' => '$N远远对$n叫道：「$n$r，$s在这给你把风，否则你给人乱刀分尸，没人报讯，未免死得太冤。」'
            },
  'piggy' => {
               'others' => '$N扯着嗓子嚷：“天哪，这那里是人住的地方，这简直是猪窝嘛! ! ”',
               'others_target' => '$N指着$n说：“你这头猪，整天就知道玩泥巴，真是猪性难改! ”'
             },
  'joke' => {
              'others' => '$N打了个哈哈，笑道：「别当真，$S只是开个小小的玩笑。」 ',
              'others_target' => '$N吓得茶碗一下子打掉在地，对$n颤声道：「这，这，这可不是开玩笑吗？」 '
            },
  'hurt' => {
              'others' => '$N脸上一副爱怜无限的神情，问道：「你痛得利害吗？真叫人心疼。」 ',
              'others_target' => '$N尖声道：「$n$c，你。。怎么了？是给人打伤了吗？」扑到$n的身旁，把$p抱了起来，轻轻的放在床上。'
            },
  'lama' => {
              'others' => '$N一脸陶醉的唱道：“雪山、青草、美丽的喇嘛庙，没完没了的喇嘛正没完没了的喝酥油。”',
              'others_target' => '$N一脸陶醉的唱道：“雪山、青草、美丽的喇嘛庙，没完没了的$n正没完没了的喝酥油。”'
            },
  'innocent' => {
                  'others' => '$N满脸委曲地嚷到：“不是我干的！”',
                  'others_target' => '$N满脸委曲地嚷到：“$n，你可别冤枉好人！”'
                },
  'kiss3' => {
               'others' => '$N双颊红晕如火，温软的嘴唇上沾着泪水，又是甜蜜，又是苦涩。',
               'others_target' => '$N忍不住俯下头去，在$n微微颤动的樱唇上一吻，道：「好$c，你对我真好。」 '
             },
  'hug5' => {
              'others' => '$N幽幽的叹了口气，说道：「我实在非常非常的想你、爱你，只盼时时刻刻将你抱在怀里亲你、疼你。」',
              'others_target' => '$N颈中的扣子松开了，露出雪白的项颈和一条红缎子的抹胸边缘，站起身来，娇媚无限的腻声道：「$n$c，你来抱我！」声音柔腻之极。'
            },
  'lovetell' => {
                  'others' => '$N说：「孩儿，我爱你胜于自己的性命。」',
                  'others_target' => '$N双手搂着$n，把头藏在$p的怀里，轻轻说道：「我爱你！」'
                },
  'miss5' => {
               'others' => '$N说道：「我们分别了十年，我……我天天在想你。」',
               'others_target' => '$N道：「$n$c，你大前天打得我好痛，可是我没恨你，这两天来，我常常在想你。」'
             },
  'pretty4' => {
                 'others' => '$N道：「你这般美貌，真如天仙下凡一样！」',
                 'others_target' => '$N道：「萝卜青菜，各人所爱！说不定$n特别喜欢肥胖女子，一见肥女，便即魂飞天外。」'
               },
  'homework' => {
                  'others' => '$N暗暗的想：今天的作业让谁帮我做好呢？',
                  'others_target' => ' $N揪起$n的耳朵，大声叫到:“$r还不快给我回家做作业！”'
                },
  'hate2' => {
               'others' => '$N哽咽道：「今日重会，我真是说不出的喜欢，我怎会恨你？我对你的心意，永如当年送你的一朵曼陀花之日。」 ',
               'others_target' => '$N颤声道：「$n$c，你真的这般恨我么？」 '
             },
  'poke' => {
              'others' => '$N无聊地用手指捅捅这个，捅捅那个，可是没一个人理$P。',
              'others_target' => '$N无聊地用手指捅了捅$n，可是$n象根木头一样，什么反应也没有。'
            },
  'smell' => {
               'others' => '$N皱了皱眉，似乎嗅到什麽东西烧糊了。',
               'others_target' => '$N仰起脸，伸长鼻子对着空气猛嗅了几下，对着$n大声赞道：\\'
             },
  'choupai' => {
                 'others' => '$N伤心地说：“收了红心缺了２，吃了肥猪跑了羊，难道你们还忍心把变压器也给我么？”',
                 'others_target' => '$N气得哇哇大叫，指着$n嚷嚷道：“你个臭牌篓子！气煞$s了！”'
               },
  'hug' => {
             'others' => '$N轻轻地抱住梦中的情人。',
             'others_target' => '$N毛手毛脚地双手把$n一箍，$n连气都喘不过来。'
           },
  'xbc' => {
             'others' => '$N哀声叹道：我的命咋就这麽苦啊？好像那小白菜一般。。。',
             'others_target' => '$N捏起了嗓子，阴阳怪气的对$n唱道：小$n呀，你咋那么命苦呀。'
           },
  'humble' => {
                'others' => '$N拱了拱手道：过奖，过奖 !',
                'others_target' => '$N哈哈大笑，对着$n拱了拱手道：$R过奖了!'
              },
  'landscape' => {
                   'others' => '$N大赞：「这里的风景真是美妙无比。」 ',
                   'others_target' => '$N对$n笑道：「这山上没花儿，你的相貌，却比一万朵鲜花还要美丽。山上没鸟雀，你的声音，可比一千头黄莺一齐唱歌还好听。」 '
                 },
  'handkiss' => {
                  'others' => '$N把手伸得直直的，格格娇笑。',
                  'others_target' => '烛光之下，$N见到$n五根手指真如玉葱一般，忍不住伸手抓住，放在嘴巴吻了一吻。'
                },
  ':(' => {
            'others' => '$N露出一丝难过的表情。',
            'others_target' => '$N看着$n，难过的要哭了。'
          },
  'cold' => {
              'others' => '$N“啊秋”一声，冻得打了个喷嚏。',
              'others_target' => '$N举著剑，眼神象冰一样，冷冷地瞪著$n。$n不自禁地打了个多嗦，往后退了一步。'
            },
  'xixi' => {
              'others' => '$N「嘻嘻嘻」傻笑了几声。',
              'others_target' => '$N冲着$n「嘻嘻嘻」笑了几声。'
            },
  'hehehe' => {
                'others' => '$N「呵呵呵」地笑了几声。',
                'others_target' => '$N对着$n「呵呵呵」地笑了几声。'
              },
  'thanks' => {
                'others' => '$N拱手，道：「承情，承情，多多帮忙。」',
                'others_target' => '$N说道：「$n$R的好处，我今生今世，永不敢忘。」 '
              },
  'rose' => {
              'others' => '$N深情地唱道：“我早已为你种下，九百九十九朵玫瑰。”',
              'others_target' => '$n突然间被人蒙住了双眼，睁眼一看，$N站在$p的面前，手里捧着好大一簇玫瑰！'
            },
  'stingy' => {
                'others' => '$N唉声叹道：“你不知道我每一分钱都恨不得掰成两半化！”',
                'others_target' => '$N指着$n说：“你这个吝啬鬼，只怕铁公鸡遇到你都要被你扒了皮！”'
              },
  'admit' => {
               'others' => '$N喃喃自语道：坦白从宽，牢底坐穿，抗拒从严，回家过年！ 我…我…',
               'others_target' => '$N厉声对$n喝道：说！你个$r，你对伟大的社会主义有什么不轨的图谋？'
             },
  'hero' => {
              'others' => '$N声嘶力竭地大声叫道：哈！砍头不过头点地，老子十八年後又是一条好汉！',
              'others_target' => '$N对$n大声叫道：怕什麽怕，掉个脑袋不过碗大的疤，你小子有胆就跟他拼一场！'
            },
  'temper' => {
                'others' => '$N抛下长剑，笑道：「你要打我出气，我让你打便了！」 ',
                'others_target' => '$N对着$n骂道：「$r，我不狠狠揍你一顿，难消心头之恨。」 '
              },
  'bite3' => {
               'others' => '$N媚声道：「打是情，骂是爱，我爱得你要命，这才咬你。」',
               'others_target' => '突然之间，$n「啊」的一声大叫，声音刺破了寂静的黑夜。$N抬起头来，满嘴都是鲜血，竟已将$p肩头一块肉咬了下来。'
             },
  'watermelon2' => {
                     'others' => '$N哭道：你们吃瓤我吃皮，你们跑了我挨抓。我再也不和你们去偷西瓜了！',
                     'others_target' => '$N心想：$n约我半夜去偷西瓜，别不是看上我了吧？想着想着就傻笑了起来。'
                   },
  'interest' => {
                  'others' => '$N两只眼珠骨溜溜地转着，不怀好意地打量着在场的众人。',
                  'others_target' => '$N不怀好意地紧紧盯着$n，一边笑嘻嘻地踱过去答讪。'
                },
  'corpse' => {
                'others' => '$N拚尽最後一口气，又挣扎起来说道：我 ...  我去了，弟兄姐妹们 ... 保重！',
                'others_target' => '$N很利索地把$n的肚子剖了开来，塞进稻草，只一会就作成了一具好看的木乃伊。'
              },
  'noway' => {
               'others' => '$N摇头道：「不行的。」',
               'others_target' => '$N向$n摇了摇头，道：「不行的，那没有用。」脸上神情又温柔，又同情，便似是一个做$C的，看到$c忙得满头大汗要做一件力所不胜的事，因此出言规劝一般，语调也甚是亲切。'
             },
  'cry5' => {
              'others' => '$N闷闷不乐，锁起了眉头，来回走了几步，突然坐倒在地，放声大哭。',
              'others_target' => '$N不由得手足无措，问道：「喂，喂，$n，你怎么哭啦？」'
            },
  'dance' => {
               'others' => '$N高兴地想跳舞。',
               'others_target' => '$N高兴地想跟$n跳舞。'
             },
  'poor' => {
              'others' => '$N取出一个绣花荷包来，往桌上一掷，只听得嗒的一声轻响，显然荷包中没什么金银。',
              'others_target' => '$N向$n一揖到地，说道：「$S江湖漂泊，道经贵地，阮囊羞涩，床头金尽，只有恳求$R相助些金银。$R义薄云天，$S这里先谢过了。」'
            },
  'walkby' => {
                'others' => '$N背着双手踱来踱去，似乎在想什麽坏念头。',
                'others_target' => '$N看着$n踱来踱去，摇摇头，叹口气，又摇了摇头。'
              },
  'newyear' => {
                 'others' => '$N打了个大揖，笑呵呵地说道：新年好，恭喜发财！',
                 'others_target' => '$N打了个大揖，对着$n笑呵呵地说道：新年好，恭喜发财！'
               },
  'blush' => {
               'others' => '$N的脸「唰」的一下红了起来。',
               'others_target' => '$N看着$n，脸「唰」的一下红了起来。'
             },
  'monkey' => {
                'others' => '$N一跤摔到地上，屁股红得像猴子似的。',
                'others_target' => '$N一拍桌子，对着$n生气的叫道：「你耍俺？！你把俺当猴子耍？！」'
              },
  'blush2' => {
                'others' => '$N羞得满脸通红，只觉得耳根子和脖子都在发烧。',
                'others_target' => '$N向$n望了一眼，突然晕红双颊，急忙转开了头。'
              },
  'touch' => {
               'others' => '$N感动极了，两行热泪夺眶而出。',
               'others_target' => '$N冲上前去，激动地紧紧握住$n的双手，哽咽着说不出话来。'
             },
  'pat' => {
             'others' => '$N拍了拍自己的头。',
             'others_target' => '$N轻轻地拍了拍$n的头。'
           },
  'watermelon' => {
                    'others' => '$N不怀好意的打量着在场的姐姐妹妹，自言自语道：今ㄦ个骗谁和我去偷西瓜呢？',
                    'others_target' => '$N柔声唱道：小河流水哗啦啦，我和$n偷西瓜！'
                  },
  'die' => {
             'others' => '只听$N说道：「人生莫不有死，得一知己，死亦无憾。」 ',
             'others_target' => '$N说道：「$C纵横江湖，生平无一知己，与$n$R一齐死这里，倒也开心。」伸出手去，说：「咱们握一握手再死。」'
           },
  'idle' => {
              'others' => '$N一头撞在墙上，顿时两眼发直，茫茫不知所措。',
              'others_target' => '$N对着$n狠狠的一锤当头敲下，狞笑道：你给我发呆去吧！'
            },
  'buddhi' => {
                'others' => '$N摇了摇头，叹道：南无阿弭佗佛！ 罪过！罪过！',
                'others_target' => '$N对$n合什为礼，说道：阿弭佗佛！ $R，贫僧这厢有礼了！'
              },
  'ok' => {
            'others' => '$N痛快地说道：好吧！',
            'others_target' => '$N痛快地对$n说道：好吧！'
          },
  'knife' => {
               'others' => '$N掏出了一把小刀子。',
               'others_target' => '$N一手笑嘻嘻拍着$n的肩头，一手掏出把小刀子，往$n的后心捅进去。'
             },
  'dream2' => {
                'others' => '$N站起身来，随即又叹了口气，自言自语：「我又在做梦了，梦里又听到你在叫我啦。」',
                'others_target' => '$N紧紧抱住$n温软的身子，在$p耳边低声道：「亲亲$n，你不是做梦，是我在做梦！」'
              },
  'grpfight' => {
                  'others' => '$N声嘶力竭地叫道：“大伙并肩子上啊！”',
                  'others_target' => '$N声嘶力竭地叫道：对$n这样的$r还讲什么江湖道义，大伙并肩子上啊！'
                },
  'husband' => {
                 'others' => '$N说道：「在下对皇上是忠，对朋友是义，对母亲是孝，对丈夫是爱....」',
                 'others_target' => '$N心想老公也好几天没来了，自己是否该到外面去找找$n$c呢？ '
               },
  'cook' => {
              'others' => '$N撸起袖子准备做菜。',
              'others_target' => '$N把$n做成的肉块放进锅里用薄油炒了炒，再盛到沙锅里用大汤文火炖烂。'
            },
  'alive' => {
               'others' => '$N喝道：「你要死还是要活？」 ',
               'others_target' => '$N脸色一沉，对$n喝道：「你若要活，便叫我一百声“亲爷爷”！」 '
             },
  'smash' => {
               'others' => '$N披发仗剑，念起天魔大咒，四周荒野间顿时鬼哭狼嚎，天空上传来阵阵狞笑声：你们都给我死吧！',
               'others_target' => '$N高举双手大喝：去死吧！ 从天上降下一道闪电将$n化作一堆灰烬。'
             },
  'pei' => {
             'others' => '$N脸上一红，道：「在那山洞之中，我就已打定了主意，你到那里，我跟到那里。除非你把我杀了，才能撇下我。」',
             'others_target' => '$N握着$n的手，道：「$n$c，我一定要跟着你，$N要天天这般服侍你。」 '
           },
  'ghost' => {
               'others' => '$N低声道：「啊哟！有鬼！」 ',
               'others_target' => '$N对$n说道：「我死了之后，在阴世保佑你，从早到晚，鬼魂总是跟在你身旁。」 '
             },
  'poem2' => {
               'others' => '$N哀叹道：忍看朋辈成新郎，怒向泥潭觅小妞。',
               'others_target' => '$N对着$n哀叹道：忍看朋辈成新郎，怒向泥潭觅小妞。'
             },
  'pain2' => {
               'others' => '$N脸上微微一红，骂道：“呸，谁怜惜你了，下次不听话，我下手就再重些。”',
               'others_target' => '$N望着$n温柔地说道：“$c虽然打我，心里却怜惜我。越打越轻，生怕$C疼了。”'
             },
  'massage' => {
                 'others' => '$N使劲地给$P自己按摩，把自己弄的爽爽的。',
                 'others_target' => '$N使劲地给$n按摩，把$n弄的爽爽的。'
               },
  'handkiss2' => {
                   'others' => '$N看见雪白粉嫩的小手，想立即伸嘴去吻。',
                   'others_target' => '$N拿起$n的手，在$p手背上连连亲吻。'
                 },
  'smell2' => {
                'others' => '$N闻到一阵香气，似兰非兰，似麝非麝，气息虽不甚浓，但幽幽沉沉，矩矩腻腻，闻着不由得心中一荡。',
                'others_target' => '$N笑道：「$n$c，你过来，给我闻闻你头上那朵茉莉花香不香？」'
              },
  'cutface' => {
                 'others' => '$N微笑道：「要划得你的俏脸蛋变成一个蜜蜂窝，也不必使甚么精妙剑法。你以为我三脚猫的把式，就不能叫你变成个丑八怪么？」',
                 'others_target' => '$N怒道：「$n，我割去你的耳朵鼻子，在你雪白的脸蛋上划他十七八道剑痕，且看你那多情多义的情人，是不是还爱你这个人不像人、鬼不像鬼的丑八怪。」'
               },
  'sleeve' => {
                'others' => '$N又羞又急，只觉得突然间裸露的手膀无处可放，狼狈不堪，叫道：「你……大胆！」 ',
                'others_target' => '$N心想$n这一去，说不定明晚便不再来，情急之下，伸手便拉住$p左手袖子，嗤的一声，登时将那衣袖扯了下来，露出了白白的半条手膀。'
              },
  'today' => {
               'others' => '$N昂然挺立，狞笑道：「你想不到也有今日罢？」',
               'others_target' => '$N忍不住仰天哈哈大笑，对$n叫道：「$r啊$r，你一生作恶多端，原来也有今日。」'
             },
  'cool2' => {
               'others' => '$N沈重地说：「这里四分之三是流氓，四分之一是文盲，你们只能把自尊心摆两旁了。」 ',
               'others_target' => '$N紧紧握住$n的手激动地说到：「真是英雄所见略同！」但又转念一想，$n这$r怎麽能和自己并称英雄呢？ '
             },
  'bye3' => {
              'others' => '$N拱手说道：「多承诸位对我礼敬有加，愧不敢当，这就告辞。」',
              'others_target' => '$N淡淡的道：「$n$R，深夜滋扰，甚以为歉，这就告辞了。」'
            },
  'hmm' => {
             'others' => '$N皱了皱眉，似乎想说什么。',
             'others_target' => '$N皱了皱眉，似乎想对$n说些什么。'
           },
  'dog' => {
             'others' => '$N不耐烦起来，大声喝道：「两个狗男女，都给我滚出来！」',
             'others_target' => '$N对$n道：「你拿好了剑，等我斩断他二人的手足，再由你亲手取这双狗男女的性命。哼，捉奸捉双，叫这对狗男女死而无怨！」'
           },
  'grin' => {
              'others' => '$N邪恶地发出一阵阴笑声。',
              'others_target' => '$N对着$n发出一阵阴笑声。'
            },
  'hi' => {
            'others' => '$N双手抱拳，作了个揖道：各位英雄请了！',
            'others_target' => '$N双手抱拳，对$n作了个揖道：这位$R请了！'
          },
  'visit2' => {
                'others' => '$N说道：「$S路过贵地，未曾拜候，实是礼数不周。」',
                'others_target' => '$N拱手道：「久仰$n师傅大名，当真是如雷贯耳，今日有幸得见。」'
              },
  'points' => {
                'others' => '$N的手指在空中象画符似乱比划着。',
                'others_target' => '$N满脸涨红的指着$n高喊：就是$p，就是这$r干的！'
              },
  'sing3' => {
               'others' => '$N鼓掌喝采，道：「唱得好，唱得妙，唱得刮刮叫。」 ',
               'others_target' => '$N对着$n哈哈大笑，唱道：「呜嘟嘟，吹法螺，呜哩哩，吹牛皮。」 '
             },
  'hug6' => {
              'others' => '$N道：「来，让我抱抱你，别了十年，你是轻了些呢，还是重了些？」',
              'others_target' => '$N伸出双臂，环抱在$n颈中，将脸颊挨在$p面上，不住轻轻的揉擦，一头秀发如水波般不住颤动。'
            },
  'anniversary' => {
                     'others' => '$N皱着眉头想啊想，今天我们来记念个什么节日，好上全聚德吃顿烤鸭子呢？！',
                     'others_target' => '$N对着$n狞笑着地说道：$r，明年的今天，就是你的忌日！'
                   },
  'nod' => {
             'others' => '$N点了点头。',
             'others_target' => '$N对着$n点了点头。'
           },
  'chicken' => {
                 'others' => '$N「咯咯」大叫两声，一头冲进了茅草堆里。',
                 'others_target' => '$N看了$n禁不住心头火起，一脚踢得$p「咯咯」乱叫，羽毛漫天。'
               },
  'head' => {
              'others' => '$N把头枕得高高的，笑道：“我命系于天，孰奈吾何？”',
              'others_target' => '$N摸着$n的后脑勺，朗声问道：“大好头颅，谁刀砍之？”'
            },
  'marriage' => {
                  'others' => '$N笑道：“你这泼婆娘，想谋杀亲夫么？”',
                  'others_target' => '$N伸手过去，扣住$n的手腕，叹道：“想不到我$N，竟也终身和一支大马猴锁锁在一起，再也不分开了。”说着嫣然一笑，娇柔无限。'
                },
  'sister' => {
                'others' => '$N作了一个揖，说道：“各位姐妹们，大家好！”',
                'others_target' => '$N对$n行了个礼，说道：“$n姐姐好！”'
              },
  'kiss8' => {
               'others' => '$N只觉一股葱蒜臭气直冲而来，几欲作呕。',
               'others_target' => '$N低下头去，但见$n苍白憔悴的脸上情意盈盈，眼波流动，说不尽的娇媚无限，忍不住俯下头去，在$p微微颤动的樱唇上一吻。'
             },
  'smile3' => {
                'others' => '$N脸上露出了淡淡的笑容。',
                'others_target' => '$N向着$n神色温柔的一笑，脸上更似开了一朵花。'
              },
  'nosay' => {
               'others' => '$N说道：「说不得就是说不得，还有甚么道理好讲。」',
               'others_target' => '$N叹道：「$n，你为朋友卖命，那是没得说的，可是你得小心自己的老命。」'
             },
  '?' => {
           'others' => '$N脸上露出迷惑的表情。',
           'others_target' => '$N似乎不懂$n是什么意思。'
         },
  'push' => {
              'others' => '$N不耐烦地哼叽，那是谁，怎么比猪还慢啊？要么大伙拱你算了。',
              'others_target' => '$N不耐烦地对$n哼叽，你怎么比猪还慢啊？要么大伙拱你算了。'
            },
  'huamei2' => {
                 'others' => '$N提起笔来，笑道：「从今天起，我天天给你画眉。」',
                 'others_target' => '$N格格轻笑，说道：「$n$c，你可曾答允了天天给我画眉？」'
               },
  'haha' => {
              'others' => '$N「哈哈哈」大笑几声。',
              'others_target' => '$N对着$n「哈哈哈」大笑几声。'
            },
  'smile' => {
               'others' => '$N微微笑了笑。',
               'others_target' => '$N朝$n微微笑了笑。'
             },
  'sigh4' => {
               'others' => '$N幽幽叹了口气。',
               'others_target' => '$N心道：「我$N若是无福，怎地让我听到$n$c的几声叹息、几句言语？又让我见到了$p神仙般的体态？ 若说有福，怎么连$p的一面也见不到？」'
             },
  'lanlan' => {
                'others' => '$N伤心地唱道：“在那遥远的地方，可有我心爱的兰兰？”',
                'others_target' => '$N对着$n指天发誓：“如果你是兰兰，我一定就是二皮风！”'
              },
  'highhand' => {
                  'others' => '$N高声宣布：如果巫师是中央领导，那想$s这样的泥潭高手多少也算是个地方干部了！',
                  'others_target' => '$N满脸媚态的对$n赞道：$R可真算得上本泥潭的栋梁之材！'
                },
  'hate3' => {
               'others' => '$N退开数步，小脸胀得通红，怒道：「你们……你们都是坏人，都欺负我。我……我恨你们……」突然掩面大哭。',
               'others_target' => '$N对$n叫道：「你这小淫贼，我恨你，我恨你！」'
             },
  'fear' => {
              'others' => '$N面露怯色，好像害怕什么。',
              'others_target' => '$N被$n吓得脸都白了。'
            },
  'stare' => {
               'others' => '$N气喘吁吁，两只大眼瞪得通红。',
               'others_target' => '$N恶狠狠地盯着$n：$r，我看你这次往哪儿跑。'
             },
  'cry6' => {
              'others' => '$N再也忍耐不住，泪珠儿一滴一滴的落了下来。',
              'others_target' => '$N两行泪水从面颊上流了下来，终于再也忍耐不住，伏在$n的怀里放声大哭。'
            },
  'crazy' => {
               'others' => '$N摇摇头，叹口气道：“疯了，都疯了...”',
               'others_target' => '$N对$n摇摇头，叹口气道：“完了，$n发疯了...”'
             },
  'killair' => {
                 'others' => '$N一双眸子里的杀气仿佛一把利刃，伴随着目光冷冷地扫过每个人的身上。',
                 'others_target' => '$N杀气腾腾地瞪视着$n，目光中象要喷出火来！'
               },
  'noshame' => {
                 'others' => '$N挺了挺胸，神气地说：$s我最厉害，你们没一个是我的对手。',
                 'others_target' => '$N挺了挺胸，神气地对$n说：那当然啦。'
               },
  'hug2' => {
              'others' => '$N紧紧地拥抱着梦中的情人。',
              'others_target' => '$N心疼地把$n搂在怀里。'
            },
  'bug' => {
             'others' => '$N捏著一只小虫子，大声喊道：报告巫师，发现一只ＢＵＧ ！',
             'others_target' => '$N不知从哪儿扒拉出一只臭虫，手忙脚乱地递给$n：快瞧瞧，好大只儿 ！'
           },
  'mad' => {
             'others' => '$N怒道：「气死我也，气死我也！」',
             'others_target' => '$N自怒不可遏，刷的一声，拔出腰间佩刀，喝道：「气死我了，我先杀了$n这$r再说。」'
           },
  'sword2' => {
                'others' => '$N解开衣襟，露出胸口剑疤，笑道：「这一剑是你刺的！你越刺得我深，我越是爱你。」',
                'others_target' => '$N伸出纤纤素手，轻轻抚摸$n胸口的伤痕，心中苦不胜情，突然脸色苍白，说道：「一报还一报，将来你便一剑将我刺死，我也不懊悔。」'
              },
  'disapp2' => {
                 'others' => '$N失望极了。',
                 'others_target' => '$N对$n失望极了：$n没救了。'
               },
  'cut' => {
             'others' => '$N正用一把指甲刀细心地削着手指甲。',
             'others_target' => '$N扬起一把牛角解腕尖刀，三下两下就把$n剁成了许多小块，放在太阳底下晒干。'
           },
  'hungry2' => {
                 'others' => '$N肚子饿得咕咕叫，眼睛在到处找有什么吃的。',
                 'others_target' => '$N看着$n，喉咙里“咕噜”的响了一下，眼中冒出火来！'
               },
  'wanfu' => {
               'others' => '$N道了个万福。',
               'others_target' => '$N对$n道了个万福。'
             },
  'uandme' => {
              'others' => '$N狂笑道：“天下英雄，唯我独尊！”',
              'others_target' => '$N豪情万丈地说道：“天下英雄，唯我与$n也！”'
            },
  'sweat2' => {
                'others' => '$N额头冷汗涔涔而下。',
                'others_target' => '$N问道：「$n$c，你身上很热，是不是，我给你抹抹汗。」从怀中抽出一块素帕，走到$n身前，轻轻给$p抹去了额头的冷汗。'
              },
  'idle2' => {
               'others' => '$N望着远方的天空，静静地出神。',
               'others_target' => '$N望着$n，静静地出神。'
             },
  'fire' => {
              'others' => '$N瞅着大姑娘小媳妇，心想：找谁对个火儿呢？',
              'others_target' => '$N嘿嘿傻笑两声，对着$n说道：“$c，我想跟你对个火儿。”'
            },
  'rich' => {
              'others' => '$N拍拍腰边的钱袋，粗声大气地说道：怕什么！$s有的是钱！',
              'others_target' => '$N拍拍钱袋，对着$n豪气干云地说道：你想要什么？ 尽管跟我说！'
            },
  'pig' => {
             'others' => '$N大声吆喝，又肥又壮的猪，有没有人拱啊？',
             'others_target' => '$N对着$n大声吆喝，又肥又壮的猪，要不要拱啊？'
           },
  'punish' => {
                'others' => '$N冷笑道：「哼！哪一天心中不高兴了，说不定会整治得你死不了，活不成，那时候你可别怪我。」',
                'others_target' => '$N道：「$n$c，我先斩断了你的腿，叫你一辈子不能离开我。」'
              },
  'sorry3' => {
                'others' => '$N说道：「你。。你倘若仍要生气，我只好给你跪下了。」 双膝一屈，登时便跪了下来。',
                'others_target' => '$N说道：「$n$c，千不是，万不是，都是我$N的不是，千万请你担代。」 '
              },
  'boat' => {
              'others' => '$N手持麦克风说道：“我来给大家唱个《$s的爱》，希望大家喜欢。”',
              'others_target' => '$N冲着$n大声干号道：“$c你坐船头，$C岸上走，恩恩爱爱仟绳荡悠悠。”'
            },
  'brother2' => {
                  'others' => '$N伤感的叹道：“煮豆持作羹，漉菽以为汁，箕在釜下燃，豆在釜中泣，本是同根生，相煎何太急。”',
                  'others_target' => '$N对$n失望叹道：“你我本为同根生，相煎何太急呼？！”'
                },
  'trip' => {
              'others' => '$N的左脚踩在$P的右脚上，拌了自己一个跟头。',
              'others_target' => '$N悄悄的把脚伸在$n前面，咕咚一声，$n摔了个大马趴。'
            },
  'pk2' => {
             'others' => '$N叫道：「杀死人啦，快出来救人！」',
             'others_target' => '$N叫道：「$n$c，你被杀死了，我就来救，杀死了别人，我爱瞧热闹！」'
           },
  'doubt' => {
               'others' => '$N越听越糊涂，呆呆的说道：你们究竟在说些什么玩意儿？ 我怎么不知道呀！',
               'others_target' => '$N歪着脑袋，似乎很不明白为什麽$n死的时候白白的肚皮朝着天。'
             },
  'deadlove' => {
                  'others' => '$N看著岸边的桃花一片片逝水流去，悲叹道：三生恨，一世情，人间何处觅知音！',
                  'others_target' => '$N深情款款地凝视着$n，嗔道：你死了，我怎么还能独活着！'
                },
  'rabbit2' => {
                 'others' => '$N奶声奶气的唱道：小妹妹乖乖，把门儿开开，外婆要进来……',
                 'others_target' => '$N对着$n阴险的唱道：小$n乖乖，把门儿开开，外婆要进来……'
               },
  'kiss4' => {
               'others' => '$N但觉樱唇柔软，幽香扑鼻，一阵意乱情迷。',
               'others_target' => '$N低下头来，见$n娇羞之态，娇美不可方物，心中一荡，便凑过去在$p脸颊上吻了一下。'
             },
  'happy' => {
               'others' => '$N听到有人称赞自己美貌，心中喜欢，嫣然一笑，真如异花初胎，美玉生晕，明艳无伦。',
               'others_target' => '$N心中甚喜，眼光在$n脸上一转，秋波流动，梨涡浅现。'
             },
  'pretty3' => {
                 'others' => '$N忽然赞道：「啊，你真是好看！」语气之中，充满了激赏之意。',
                 'others_target' => '$N对$n赞道：「倘若你丑怪，天下便没美丽的人了。古往今来，公主成千成万，却哪有一个似你这般好看？」'
               },
  'drinkcup2' => {
                   'others' => '$N道：「来来来，再陪我喝一杯，喝够一个成双成对。」',
                   'others_target' => '$N左手伸过去抚摸$n脸，说道：「我要你喝得迷迷糊糊的。」'
                 },
  'hungry' => {
                'others' => '$N说道：「我肚里饿得冒出火来啦，你便是我的亲兄弟、亲儿子，我也连皮带骨的吞了你。」',
                'others_target' => '$N横眼瞧着$n，嘴角边滴下馋涎，伸舌头在嘴唇上下舐了舐，自言自语：「嗯，细皮白肉，肥肥嫩嫩的……」'
              },
  'away2' => {
               'others' => '$N登时大怒，走上一步，喝道：「甚么东西，敢在这里撒野！」',
               'others_target' => '$N对$n厉声喝道：「快些让开，恶狗拦路，你不是自己找死……」'
             },
  'handshake' => {
                   'others' => '$N对着空气握了握手', 
                   'others_target' => '$N跟$n握了握手。'
                 },
  'nomatch' => {
                 'others' => '$N仰首面对苍天，狂笑不已，长叹道：难道这天底下，竟然没有人是我的对手？！',
                 'others_target' => '$N剑眉一轩，冷冷的瞥了$n一眼，背转身淡淡说道：你，不是我的对手。'
               },
  'kissme' => {
                'others' => '$N抿嘴笑道：「给我一个吻，可以不可以？」',
                'others_target' => '$N脸上泛着微红，向$n指了指自己的脸，想和$p来个亲吻。'
              },
  'kiss2' => {
               'others' => '$N盯着别人的嘴唇，咽了一口唾沫。',
               'others_target' => '$N一把抱住了$n，叫道：大功告成，亲个嘴儿！'
             },
  'noaddress' => {
                   'others' => '$N嘴唇动了几下，声音细若蚊鸣，脸上已羞得通红。',
                   'others_target' => '$N对$n低声道：「你可别出声，恶人要剥光你的衣衫，打你屁股，打得痛得不得了。」 '
                 },
  'kiss6' => {
               'others' => '$N满脸飞红，娇羞无限，伸手推开了。',
               'others_target' => '$N伸手在$n肩上轻轻抚摸，凑过樱桃小口，吻$p的脸颊，渐渐从头颈而吻到肩上，口中唔唔唔的腻声轻哼，说不尽的亲怜密爱。'
             },
  'mo97' => {
              'others' => '$N色心大动，盯着人群里的姑娘两手乱颤。',
              'others_target' => '$N陶醉地低声唱道，“一呀摸，摸到$n姐姐的头发边……”'
            },
  ':)' => {
            'others' => '$N脸上露出了一丝笑容。',
            'others_target' => '$N对着$n笑了笑。'
          },
  'happy2' => {
                'others' => '$N见有人对自己这么好，不由得满脸通红，又是高兴，又是难过，又想嘻笑，又想哭泣，泪珠儿在眼眶中滚来滚去。',
                'others_target' => '$N满心欢悦，望着$n的脸，低声道：$c，这是你的真心话吗？是不是为了让我欢喜，故意说些好听言语？'
              },
  'newyear2' => {
                  'others' => '大年三十了，$N嘴里塞满了饺子，一手抄着炮仗，一手举着灯笼，兜里揣满红包，挨家挨户地磕头拜年。',
                  'others_target' => '大年夜了，爆竹声中，$N拍拍$n的头，笑眯眯地说：“乖孩子，给$S磕三个响头，$S就发红包喽。”'
                },
  'boast' => {
               'others' => '$N满腔怒火如焚，喝道：「你为何这般不三不四，戏耍$s？」 ',
               'others_target' => '$N拍手唱道：「$n$r爱吹牛，自夸天下无敌手，望见$N东边来，脚下加油朝西走。」 '
             },
  'chicken1' => {
                  'others' => '$N象老母鸡似的咯咯咯地傻笑了几声。',
                  'others_target' => '$N皱着眉头对$n说：你怎么笑起来跟老母鸡似的?'
                },
  'grass' => {
               'others' => '$N挺起胸膛，慨然说道：“天涯何处无芳草？是英雄何患无妻！”说完仰天长笑。。。',
               'others_target' => '$N对$n劝到：“天涯何处无芳草？离开那位不知冷暖的狠心人最好，$R一定很快就会找到更称心如意的心上人的！”'
             },
  'kiss5' => {
               'others' => '$N转头闪避，怒道：「你跟人家不干不净，又来吻我。当我是好欺的么？」',
               'others_target' => '$N大喜，伸手搂住$n头颈，便在$p脸颊亲了两亲，嘴唇上搽的胭脂在$n脸上印了两个红印。'
             },
  'shout' => {
               'others' => '$N咬牙切齿地对着天空大叫：“贼老天！”',
               'others_target' => '$N瞪大眼，对着$n大声喊道：“左右是个死，$s跟你拼了！”'
             },
  'bored' => {
               'others' => '$N打了个哈欠，觉得无聊极了。',
               'others_target' => '$N白了$n一眼，说：你无聊不无聊啊?'
             },
  'slogan' => {
                'others' => '$N高举右拳，咬牙切齿地高呼：“打倒侠客行！”',
                'others_target' => '$N高举右拳，咬牙切齿地高呼：“打倒$n！”'
              },
  'ugly5' => {
               'others' => '$N笑道：「这么丑八怪的模样，有那个男人肯来瞧你？」',
               'others_target' => '$N顺手从桌上拿起一面明镜，对准了$n，笑道：「你自己瞧瞧，美貌不美貌？」'
             },
  '!!!' => {
             'others' => '$N使出吃奶的力气叫喊：“杀人啦！救命啊！”',
             'others_target' => '$N对$n说：“嚷什么嚷？你这样的$r，死了活该！”'
           },
  'sour' => {
              'others' => '$N破口大骂道：瞧这黄脸婆,我和女孩说句话都不行!标准醋缸一个!',
              'others_target' => '$N觉得$n酸透了，就蘸着$n吃了半斤饺子。'
            },
  'truelove' => {
                  'others' => '$N眼光突然明亮，喜道：「你说咱俩永远厮守在一块，这话可是真的？」',
                  'others_target' => '$N抢到窗口，柔声道：「$n，你进来，让我多瞧你一会儿。你从此别走了，咱俩永远厮守在一块。」'
                },
  'welcome' => {
                 'others' => '$N左手高举旗帜，右手拿起扩音器，哽咽地高呼道：“欢迎，欢迎，热烈大欢迎！”',
                 'others_target' => '$N左手高举旗帜，右手拿起扩音器，哽咽地对着$n高呼道：“欢迎，欢迎，热烈大欢迎！”'
               },
  'shake' => {
               'others' => '$N把头摇得跟拨浪鼓似的。',
               'others_target' => '$N对着$n摇了摇头。'
             },
  'slap' => {
              'others' => '$N的手好象蠢蠢欲动。',
              'others_target' => '$N打了$n一记响亮的耳光。$n直纳闷：怎么白天出星星？'
            },
  'guazi' => {
               'others' => '$N抓起一把瓜子送进嘴里，「噗！」地吐出许多瓜子壳。',
               'others_target' => '$N抓起一把瓜子递给$n：很无聊吧？来，尝尝这瓜子，注意不要乱吐壳儿啊！'
             },
  'brother' => {
                 'others' => '$N弯弯腰，道了个万福：“各位大哥，$N有礼了！”',
                 'others_target' => '$N甜甜地跟$n打招呼：“$n哥哥好呀～”'
               },
  'taste' => {
               'others' => '$N舌头伸到嘴边舔了舔，大声赞道:\\',
               'others_target' => '$N盯着$n上上下下地看，一边咕噜噜地使劲咽着唾沫。'
             },
  'admire3' => {
                 'others' => '$N站起身来，说道：「各位前辈德高望重，名扬四海，果然是武林至尊，号令天下，莫敢不从。」 ',
                 'others_target' => '$N抱拳道：「$n$R近年名震江湖，$S如雷贯耳，今日见到$R身手，果然利害得紧，嘿嘿，佩服，佩服。」 '
               },
  'slap2' => {
               'others' => '$N突然踏上一步，手掌一扬，便想给一个耳光。',
               'others_target' => '只听得拍拍拍、拍拍拍六声响，$n脸上吃了六记耳光，哇的一声，口吐鲜血，数十枚牙齿都撒在地下。这一瞬之间倏忽来去，$N竟似并未移动过身子。'
             },
  'nolove' => {
                'others' => '$N一声长叹：「我。。我要死了。但愿你们百年齐眉，白头偕老。」 身子向后便倒。',
                'others_target' => '$N一声长叹：「爱美之心，人皆有之。$n$c，你我同是天涯沦落人，此恨绵绵无绝期！」'
              },
  'lovelook' => {
                  'others' => '$N遥望着在场的众人，微微一笑。一双妙目间情意流动，顾盼生姿。',
                  'others_target' => '$N拉着$n的手，温柔地默默对视。目光中孕含着千种柔情，万般蜜意。'
                },
  'face' => {
              'others' => '$N吐了吐舌头，扮个鬼脸。',
              'others_target' => '$N回过头来，对着$n扮了个鬼脸，舌头伸得长长的。'
            },
  'bite2' => {
               'others' => '$N笑道：「我也来狠狠的咬上一口，教你一辈子忘不了我。」 ',
               'others_target' => '突然之间，$N抓起$n的手来，提到口边，在$p的手背上狠狠的咬了一口。'
             },
  'oh' => {
            'others' => '$N惊讶的说道：“噢！是吗？”',
            'others_target' => '$N惊讶的对$n说道：“噢！是吗？”'
          },
  'dontgo2' => {
                 'others' => '$N吓得要晕去，叫道：「别……别去……」',
                 'others_target' => '$N解下短剑，走到$n面前，道：「别伤心！你见了这剑，就如见到我一样。」将剑放在$p身上。'
               },
  'mooncake' => {
                  'others' => '$N问道：「你爱吃咸的月饼，还是甜的？」',
                  'others_target' => '$N色迷迷的说：「$n$c，你身上的月饼，自然是甜过了蜜糖。」'
                },
  'cry4' => {
              'others' => '突然之间，$N也不知道为什么伤心难过，悲从中来，再也忍耐不住，泪水从脸颊上流了下来。',
              'others_target' => '$N突然拉着$n的衣袖，哇的一声哭了出来。哭了一会，心中舒畅，拉起$p的衣袖来擦了擦眼泪。'
            },
  'says' => {
              'others' => '$N自言自语不知道在说些什么。',
              'others_target' => '$N对$n冷笑道∶“$s大好男儿，竟和你这$r齐名！”'
            },
  'shutup' => {
                'others' => '$N满头大汗地蹲在小铜炉边煨他的狗皮膏药，一边鼓着腮帮子拼命吹风。',
                'others_target' => '$N把一张狗皮膏药放在小铜炉上细细地煨热了，轻轻托住$n的下巴，叭地贴了上去。'
              },
  'wa' => {
            'others' => '$N又惊又喜，叫道：「哇！好厉害哦！」',
            'others_target' => '$N又惊又喜，叫道：「哇！$n$c，你好厉害哦！」'
          },
  'miss3' => {
               'others' => '$N道：「你为甚么这般不高兴？说给我听听，成不成？」',
               'others_target' => '$N见$n这般神气，突然喝道：「$r，你心里在想甚么？」'
             },
  'nocry2' => {
                'others' => '$N柔声安慰：「好孩子，别哭，别哭！」',
                'others_target' => '$N伸衣袖给$n抹去泪水，笑道：「脸上又是眼泪，又是手指印，人家还道是我把你打哭了呢。」 '
              },
  'flirt2' => {
                'others' => '$N低头温柔地说道：你累了吗？因为你昨夜一直徘徊在我的梦里。',
                'others_target' => '$N柔声对$n说道：你爸爸一定是个小偷，他把天上最亮的两个星星偷下溶进了你的眼睛。'
              },
  'loveme' => {
                'others' => '$N脸上烫热如火，微笑道：「你跟我说，你是不是真的很喜欢我？」',
                'others_target' => '$N握住$n的手，轻轻在自己脸上抚摸，低声道：「$n$c，你喜不喜欢我？」'
              },
  'tie' => {
             'others' => '$N取出一根缠着牛筋的丝绳来，笑道：「我得用绳子绑住你双手，然后……然后，再用一缕柔丝，牢牢绑住你的心。」',
             'others_target' => '$N媚笑道：「$n$c，我想绑绑你的手，跟你玩个新鲜花样儿。」说着将$n双手拉到背后，用牛筋丝绳牢牢的缚住，接连打了七八个死结。'
           },
  'lazy' => {
              'others' => '$N伸了个懒腰。',
              'others_target' => '$N伸着指头数落$n：“贪吃，贪睡，不干活，不可教也！”'
            },
  'ugly6' => {
               'others' => '$N将人皮面具往脸上一罩，喝道：「你丑还是我丑？」',
               'others_target' => '$N啐道：「$n$c，瞧你这副脏模样，丑八怪也不肯嫁你做媳妇儿。」'
             },
  'suffer' => {
                'others' => '$N痛得惨叫一声，跳了起来，不住口的大叫：「好痛，痛得命也没了。」',
                'others_target' => '$N一怔，道：「$n$c，你大前天打得我好痛，可是我没恨你，这两天来，我常常在想你。」'
              },
  'miss2' => {
               'others' => '$N道：「我记挂你，身子安好么？心上快活么？大事小事都顺遂么？只要你好，我就开心了，做人也有了滋味。」',
               'others_target' => '$N低声的道：「我那一天不是牵肚挂肠的想着我的小$n？恨不得插翅飞来，将你搂在怀里，好好的怜你惜你。」'
             },
  'lasa' => {
              'others' => '$N拍着阿姐鼓，声嘶力竭的干嚎道：“来吧，来吧，我们一起回拉萨，见到阔别已久的大喇嘛。”',
              'others_target' => '$N拍着阿姐鼓，声嘶力竭的对$n干嚎道：“来吧，来吧，我们一起回拉萨，见到阔别已久的大喇嘛。”'
            },
  'wake' => {
              'others' => '$N伸了伸懒腰，大声叫到：「懒猪们！都起来了！」 ',
              'others_target' => '$N摇着$n试着把$p叫醒，大声在$p耳边叫道：「 懒猪！起来了！」 '
            },
  'marriage3' => {
                   'others' => '$N轻声说道：「我心中已有了你这个狠心短命的小鬼，你短命死了，我便给你守一辈子的活寡。你说，$N待你好不好啊？」',
                   'others_target' => '$N轻轻抚摸$n的头发，心中一片平静温暖，心道：「得妻如此，复有何憾？」'
                 },
  'laugh2' => {
                'others' => '$N突然哈哈大笑，前仰后合，似是听到了最可笑不过的笑话。',
                'others_target' => '$N对$n冷冷的道：「哼，笑也笑过了，最多不过是再给我笑一场，还会笑死人么？」'
              },
  'shoupa' => {
                'others' => '$N拿出陈园园手帕，一边四处张望，一边嘀咕：我帮谁搽汗好呢？',
                'others_target' => '$N微笑对着$n说道：“那天晚上你香汗淋漓，我也曾给你抹了汗来，这手帕，我十几年来一直带在身边。”'
              },
  'kiss11' => {
                'others' => '$N被吻住了嘴巴，登时说不出话来。',
                'others_target' => '$N心花怒放，抱住$n，在$p两边面颊上连连亲吻。'
              },
  'pain' => {
              'others' => '$N痛得“嗷嗷嗷”怪叫不停。'
            },
  'sorry2' => {
                'others' => '$N摇了摇头，低声说道：「$S行止不端，德行有亏，平生荒唐之事，实在干得太多，思之不胜汗颜。」',
                'others_target' => '$N大声道：「皇天在上，后土在下，$S$N今日诚心诚意，向$n$R认错。」'
              },
  'applaud' => {
                 'others' => '$N「啪啪啪」鼓起掌来。',
                 'others_target' => '$N对着$n鼓起掌来，干得好。'
               },
  'haose' => {
               'others' => '$N笑道：「你伤了人家多少闺女？嘿嘿，你一味好色贪花，不顾身子，这才失手，是不是？」',
               'others_target' => '$N道：「$n有多大本事，我可知道得一清二楚，这人贪懒好色，练剑又不用心，就只甜嘴蜜舌的骗女人倒有几下散手。」'
             },
  'shy' => {
             'others' => '$N低下头摆弄衣角，满脸红晕。',
             'others_target' => '$N哈哈大笑：「想不到$n这$R，也会害臊。」 '
           },
  'lovefool' => {
                  'others' => '$N终于忍不住放声痛哭：「我真是个呆子，不折不扣的呆子，为何总是为了别人做傻事？」 ',
                  'others_target' => '$N望了望$n，叹了口气道：「你走吧，难道你想跟我一样，爱上一个不该爱的人？」'
                },
  'dream' => {
               'others' => '$N叹了口气，道：「我又在做梦了，真是叫我又是害怕，又是。。又是。。又是喜欢。」 ',
               'others_target' => '$N抱着$n的头颈，柔声道：「好$c，我到底是不是在做梦？」 '
             },
  'fangxin' => {
                 'others' => '$N道：「你放心一百二十个心。大丈夫一言既出，什么马难追。」',
                 'others_target' => '$N将$n搂在怀里，缓缓抚摸着$p的秀发，说道：「你放心！我永远是你的人，你永远是我的人，好不好？」'
               },
  'swear' => {
               'others' => '$N道：「我要你说，你今后心中就只有我一个儿，若是有了别人，就得给我杀死。」',
               'others_target' => '$N发誓道：「$C$N，这一生一世，心中就只有$n$c一个，倘若日后变了心，不用$c来杀，只要一见$c的脸，$C就亲手自杀。」'
             },
  'sorry5' => {
                'others' => '$N好生过意不去，说道：「对不起，对不起！是我的不是。」',
                'others_target' => '$N吓了一跳，知道自己说错了话，忙对$n道：「对不起，我胡说八道，好$c，你别见怪。」'
              },
  'kiss' => {
              'others' => '$N嘟起嘴，“卟”地一声吻了吻空气。',
              'others_target' => '$N轻轻地捧起$n的脸，给了$p一个无限温柔的吻。'
            },
  'pretty2' => {
                 'others' => '$N伸起衣袖，遮住半边玉颊，嫣然一笑，登时百媚横生。',
                 'others_target' => '$N伸臂搂住$n的肩头，笑道：「要是天仙有你这么美貌，什么吕纯阳，铁拐李，也不肯下凡了。每个神仙都留在天上，目不转睛的瞧着我的小宝贝儿。」'
               },
  'shutup1' => {
                 'others' => '$N拿出一把特大的苍蝇拍，舞了舞说：“你们这些乌鸦嘴，都给我通通闭上！”',
                 'others_target' => '$N拿出一把特大的苍蝇拍，啪地一声打在$n的嘴上，喝道：“快闭上你这三八嘴！”'
               },
  'refuse' => {
                'others' => '$N柳眉倒竖，叱道：“少打我的主意了,真是无聊透顶！我不会答应的,你就死了心吧！”',
                'others_target' => '$N呸了一声，对$n怒道：“就你这癞蛤蟆，不知砸坏了多少面镜子了，也配和我提一个爱字！”'
              },
  'joke2' => {
               'others' => '$N骂道：「你这人没规没矩，动手动脚，跟$s开什么玩笑？」 ',
               'others_target' => '$N对$n笑道：「死鬼，你跟我说风话，小心我把你心肝挖出来。」 '
             },
  'wife' => {
              'others' => '$N说道：「在下对皇上是忠，对朋友是义，对母亲是孝，对妻子是爱....」',
              'others_target' => '$N心想老婆也好几天没来了，自己是否该到外面去找找$n$c呢？ '
            },
  'courage' => {
                 'others' => '$N点了点头，挥着手说道：同志们辛苦了！',
                 'others_target' => '$N感动得热泪盈眶，向着$n振臂高呼：首长辛苦了！'
               },
  'jump' => {
              'others' => '$N高兴地跳了起来。',
              'others_target' => '$N高兴地跳进了$n的怀里。'
            },
  'beep' => {
              'others' => '$N地低沉地发出一声狮子吼：猪！起来了。',
              'others_target' => '$N对$n发出一声狮子吼：猪！起来了！'
            },
  'candy2' => {
                'others' => '$N脸上露出了笑容，伸手入怀，道：「$S给糖糖你吃。」可是一只手在怀里伸不出来，显是摸不到甚么糖果。',
                'others_target' => '$N笑道：「是$n$c给我的糖果，我舍不得吃。」'
              },
  'good2' => {
               'others' => '$N道：「以后我更要宠你一百倍，一千倍。」',
               'others_target' => '$N微微一笑，道：「$n$c，你真好，什么事情都就着我，这么宠我，如何得了？」'
             },
  'hammer' => {
                'others' => '$N大喝一声，一下把好大好大的铁锤举过头顶，杀气腾腾地四下打量着众人，双脚却急速陷进烂泥中，立刻漫过了腰。',
                'others_target' => '$N举起好大好大的铁锤，往$n头上用力一敲！“砰”的一声巨响！$n一下不见了，地上出现一个深不见底的黑洞。'
              },
  'cheat' => {
               'others' => '$N缓缓的道：「你日后若是对我负心，我也不盼望你天打雷劈，我……我……我宁可亲手一剑刺死了你。」',
               'others_target' => '$N眼光中闪出喜悦的光芒，道：「$n$c，你这是真心话呢？还是哄我？」'
             },
  'miss' => {
              'others' => '$N笑道：「这么些日子不见你，我想得你好苦，你却早将我抛在九霄云外了。」',
              'others_target' => '$N拉着$n的手，问道：「$n$c，这么多天没见到你，你想我不想？」微微仰起了头，望着$p的眼睛。'
            },
  'waggle' => {
                'others' => '你们不可以对$N这样喔！',
                'others_target' => '$n$c不可以对$N$C这样喔！'
              },
  'idea' => {
              'others' => '$N向在场众人朗声说道：「今后如何行止，要请大家合计合计。各位有何高见，务请不吝赐教。」',
              'others_target' => '$N对$n说道：「不知这位$R有何高见？」'
            },
  'polite' => {
                'others' => '$N笑道：「今后你要$S帮你做什么，尽管开口，不用客气。」 ',
                'others_target' => '$N拉着$n的手，说道：「$n$c，在有人的时候，你叫我$N，没有人的时候，咱们仍和从前一样。」 '
              },
  'smile2' => {
                'others' => '$N微微一笑，露出一口白牙，闪闪发光。',
                'others_target' => '$N对着$n嫣然一笑，露出颊上浅浅的梨涡。'
              },
  'kiss9' => {
               'others' => '$N柔声道：「我永生永世也亲你不够。」',
               'others_target' => '$N低下头去，在$n脸颊上吻了一吻，嘴唇所触之处，犹如火烫，登时情热如沸，紧紧搂住了$p，深深长吻，过了良久，方才放开。'
             },
  'rascal' => {
                'others' => '$N嘴角一撇，狞笑道：“我是流氓，我怕谁？！”',
                'others_target' => '$N对着$n大叫：“$n，你这个臭流氓！”'
              },
  'callname' => {
                  'others' => '$N卷起袖子，提着刀，拦街大骂：你们这群玩泥巴的小混蛋！通通给我滚开！',
                  'others_target' => '$N指着$n破口大骂：$r！ 敢跟$s过不去？ 你不要命了？！'
                },
  'rob' => {
             'others' => '$N横刀当道，一声大喊：此山是我开，此树是我栽，若要从此过，留下买路财 !',
             'others_target' => '$N一刀砍去，把$n的...钱袋挥作两半 !'
           },
  'eyekiss' => {
                 'others' => '$N低声道：「我要亲亲你的眼睛，你放心！我只亲你的眼睛，别的什么也不犯你。」 ',
                 'others_target' => '突然间$N大叫一声，扑上去把$n抱住，猛往$p眼皮上亲去。'
               },
  'congra' => {
                'others' => '$N大声说：恭喜！恭喜！',
                'others_target' => '$N对$n大声说道：恭喜！恭喜！'
              },
  'gongxi' => {
                'others' => '$N哈哈大笑，说道：「恭祝二位早生贵子，白头偕老！」',
                'others_target' => '$N过来拿住$n右手手腕，一搭脉搏，大声笑道：「$n$R，恭喜恭喜！」'
              },
  'pi' => {
            'others' => '$N将气息在周身运转，轻轻易易的放了个屁。',
            'others_target' => '$N说道：「素闻响屁不臭，臭屁不响，刚才的狗屁却又响又臭，莫非是$n所放吗？」'
          },
  'laugh' => {
               'others' => '$N捧住肚子，嘻嘻哈哈地直笑得两眼翻白，喘不过气来。',
               'others_target' => '$N张大眼奇怪地瞪着$n，慢慢地咧开嘴，捧腹大笑起来。'
             },
  'harsh' => {
               'others' => '$N微微一笑，说道：「贱骨头！好好跟你说，偏偏不听，定要敬酒不吃吃罚酒。」 ',
               'others_target' => '$N伏在$n的脚边，腻声道：「好$c，你给我打一次罢，我不打痛你便是。你身上出血，我见了比什么都喜欢。」 '
             },
  'zzz2' => {
              'others' => '$N心生怜惜，说道：「快别说话了，安安静静的睡一会儿。」',
              'others_target' => '$N拉过被子盖在$n身上，俯身在$p脸上轻轻一吻，笑道：「快合上眼，睡罢。」'
            },
  'cry2' => {
              'others' => '$N双手在胸口猛捶数下，大哭起来，一面乾号，一面叫道：「我孤苦伶仃的，没人疼我。做人还有什么乐趣？不如一头撞死了倒干净。」 眼泪倾泻而出，哭得悲切异常。',
              'others_target' => '$N悲喜交集，直冲进房，抱着$n双脚，放声大哭。'
            },
  'ugly3' => {
               'others' => '忽然间，$N那天下最美丽的脸庞上，已又横又竖的划上了十七八刀，肌肉翻了出来，一条条都是鲜红的疤痕。',
               'others_target' => '$N朗声道：「$n，你颧骨这么高，嘴巴大得像血盆，焦黄的脸皮，身子却又像根竹竿，人家怎会瞧得上眼？」'
             },
  'nun' => {
             'others' => '$N说道：「$s已为你做了尼姑，非嫁你不可，倘若菩萨责怪，那就只能怪我。」',
             'others_target' => '$N叹道：「$N削发为尼，从此身入空门。$n施主，咱们就此别过。」 '
           },
  'force' => {
               'others' => '$N道：「不行也得行，快，快！」',
               'others_target' => '$N对$n喝道：「你不听话，我便一刀杀了你。」将尖刀刀尖直抵到$p喉头。'
             },
  'sing4' => {
               'others' => '$N道：「我小时候睡不着，我妈便在我床边唱歌儿给我听。只要唱得三支歌，我便睡熟啦。」',
               'others_target' => '$N叹了口气，对$n幽幽的道：「你唱几支歌儿给我听吧。」'
             },
  'rude' => {
              'others' => '$N抽出兵刃，喝道：「快跪下投降，迟得一步，把你们脑袋瓜儿一个个砍下来。」 ',
              'others_target' => '$N瞪了$n一眼， 道：「在我面前，不可口出粗俗无礼的言语。」 '
            },
  'kick3' => {
               'others' => '$N低声道：「我最高明的招数，叫做“屁股向后平沙落雁式”，屁股向后，是专门给人踢的，平沙落落雁，你瞧像不像？」',
               'others_target' => '突然间呼的一声响，$n从后飞了出来，砰的一声，落在地下，臀部处有一个脚印。只听得$N清脆声音叫道：「这是$n的看家本领，“屁股向后平沙落雁式”！」'
             },
  'angry2' => {
                'others' => '$N又气又急，流泪道：「好，我知道你一点也不体惜我。我随口一句话，你也不肯轻易放过。跟你说，你不用这般恼我，干脆用不见我面就是。」',
                'others_target' => '$N满脸惶恐之色，说道：「糟糕，我这蠢材，就净是说错话，又惹$n$c生气。」 '
              },
  'taunt' => {
               'others' => '$N笑道：“你们这群小混蛋，真拿你们没办法！”',
               'others_target' => '$N对$n笑道：“你这个$r，可想煞$s了！”'
             },
  'byebye' => {
                'others' => '却听得$N朗声说道：“今番良晤，豪兴不浅，他日江湖相逢，再当杯酒言欢。咱们就此别过。”说着袍袖一拂，飘然离潭。',
                'others_target' => '其时明月在天，清风吹叶，树巅乌鸦呀啊而鸣，$N再也忍耐不住，望着$n的背影，泪珠夺眶而出。'
              },
  'rabbit' => {
                'others' => '$N小声唱道：小白兔，白又白，两只耳朵竖起来！',
                'others_target' => '$N对$n小声唱道：$n儿乖，仨红嘴唇儿，一对耳朵白又白！'
              },
  'ghost2' => {
                'others' => '$N陡然间只觉毛骨悚然，心想：「难道真的有鬼？」',
                'others_target' => '$N双腿酸软，坐倒在地，呆了半晌，喃喃的道：「$n，你是鬼，你是鬼！」'
              },
  'nod2' => {
              'others' => '$N点了点头，说道：「我知道。」',
              'others_target' => '$N满心欢悦，抬起头来，仰望着$n的双目，点了点头。'
            },
  'chan' => {
              'others' => '$N笑道：「都是你自己不好，谁教你生得这么俊，引人家非缠你不可。」 ',
              'others_target' => '$N对$n笑道：「人家不理你，偏要来纠缠不清，也不怕丑。」 说着伸手刮脸羞$p。'
            },
  'pregnant2' => {
                   'others' => '$N哭道：「咱们若不马上做夫妻，我肚子……我肚子一天天大起来……我……我可不能做人了。」',
                   'others_target' => '$N扭住$n耳朵，骂道：「我肚子里的小$n以后怎么办？」说到这里，哇的一声，哭了出来。'
                 },
  'die2' => {
              'others' => '$N轻声啐道 ：「呸！臭美么？你死你的，关我什么事，要我陪你一块儿死？」 ',
              'others_target' => '$N对$n说道：「我。。我是不想活了，你也不用想活了。」'
            }

}
end
# puts emote_list.keys.sort.join("\n")